graph torch_jit (
  %input_ids[INT32, batch_sizexsequence]
  %attention_mask[INT32, batch_sizexsequence]
) initializers (
  %embed_tokens.weight[FLOAT, 96104x1024]
  %embed_positions.weight[FLOAT, 1024x1024]
  %layers.0.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.0.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.0.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.0.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.0.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.0.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.0.fc1.bias[FLOAT, 4096]
  %layers.0.fc2.bias[FLOAT, 1024]
  %layers.0.final_layer_norm.weight[FLOAT, 1024]
  %layers.0.final_layer_norm.bias[FLOAT, 1024]
  %layers.1.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.1.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.1.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.1.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.1.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.1.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.1.fc1.bias[FLOAT, 4096]
  %layers.1.fc2.bias[FLOAT, 1024]
  %layers.1.final_layer_norm.weight[FLOAT, 1024]
  %layers.1.final_layer_norm.bias[FLOAT, 1024]
  %layers.2.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.2.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.2.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.2.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.2.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.2.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.2.fc1.bias[FLOAT, 4096]
  %layers.2.fc2.bias[FLOAT, 1024]
  %layers.2.final_layer_norm.weight[FLOAT, 1024]
  %layers.2.final_layer_norm.bias[FLOAT, 1024]
  %layers.3.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.3.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.3.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.3.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.3.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.3.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.3.fc1.bias[FLOAT, 4096]
  %layers.3.fc2.bias[FLOAT, 1024]
  %layers.3.final_layer_norm.weight[FLOAT, 1024]
  %layers.3.final_layer_norm.bias[FLOAT, 1024]
  %layers.4.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.4.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.4.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.4.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.4.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.4.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.4.fc1.bias[FLOAT, 4096]
  %layers.4.fc2.bias[FLOAT, 1024]
  %layers.4.final_layer_norm.weight[FLOAT, 1024]
  %layers.4.final_layer_norm.bias[FLOAT, 1024]
  %layers.5.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.5.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.5.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.5.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.5.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.5.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.5.fc1.bias[FLOAT, 4096]
  %layers.5.fc2.bias[FLOAT, 1024]
  %layers.5.final_layer_norm.weight[FLOAT, 1024]
  %layers.5.final_layer_norm.bias[FLOAT, 1024]
  %layers.6.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.6.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.6.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.6.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.6.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.6.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.6.fc1.bias[FLOAT, 4096]
  %layers.6.fc2.bias[FLOAT, 1024]
  %layers.6.final_layer_norm.weight[FLOAT, 1024]
  %layers.6.final_layer_norm.bias[FLOAT, 1024]
  %layers.7.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.7.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.7.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.7.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.7.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.7.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.7.fc1.bias[FLOAT, 4096]
  %layers.7.fc2.bias[FLOAT, 1024]
  %layers.7.final_layer_norm.weight[FLOAT, 1024]
  %layers.7.final_layer_norm.bias[FLOAT, 1024]
  %layers.8.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.8.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.8.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.8.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.8.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.8.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.8.fc1.bias[FLOAT, 4096]
  %layers.8.fc2.bias[FLOAT, 1024]
  %layers.8.final_layer_norm.weight[FLOAT, 1024]
  %layers.8.final_layer_norm.bias[FLOAT, 1024]
  %layers.9.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.9.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.9.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.9.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.9.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.9.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.9.fc1.bias[FLOAT, 4096]
  %layers.9.fc2.bias[FLOAT, 1024]
  %layers.9.final_layer_norm.weight[FLOAT, 1024]
  %layers.9.final_layer_norm.bias[FLOAT, 1024]
  %layers.10.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.10.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.10.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.10.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.10.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.10.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.10.fc1.bias[FLOAT, 4096]
  %layers.10.fc2.bias[FLOAT, 1024]
  %layers.10.final_layer_norm.weight[FLOAT, 1024]
  %layers.10.final_layer_norm.bias[FLOAT, 1024]
  %layers.11.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.11.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.11.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.11.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.11.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.11.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.11.fc1.bias[FLOAT, 4096]
  %layers.11.fc2.bias[FLOAT, 1024]
  %layers.11.final_layer_norm.weight[FLOAT, 1024]
  %layers.11.final_layer_norm.bias[FLOAT, 1024]
  %layers.12.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.12.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.12.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.12.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.12.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.12.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.12.fc1.bias[FLOAT, 4096]
  %layers.12.fc2.bias[FLOAT, 1024]
  %layers.12.final_layer_norm.weight[FLOAT, 1024]
  %layers.12.final_layer_norm.bias[FLOAT, 1024]
  %layers.13.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.13.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.13.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.13.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.13.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.13.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.13.fc1.bias[FLOAT, 4096]
  %layers.13.fc2.bias[FLOAT, 1024]
  %layers.13.final_layer_norm.weight[FLOAT, 1024]
  %layers.13.final_layer_norm.bias[FLOAT, 1024]
  %layers.14.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.14.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.14.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.14.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.14.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.14.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.14.fc1.bias[FLOAT, 4096]
  %layers.14.fc2.bias[FLOAT, 1024]
  %layers.14.final_layer_norm.weight[FLOAT, 1024]
  %layers.14.final_layer_norm.bias[FLOAT, 1024]
  %layers.15.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.15.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.15.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.15.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.15.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.15.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.15.fc1.bias[FLOAT, 4096]
  %layers.15.fc2.bias[FLOAT, 1024]
  %layers.15.final_layer_norm.weight[FLOAT, 1024]
  %layers.15.final_layer_norm.bias[FLOAT, 1024]
  %layer_norm.weight[FLOAT, 1024]
  %layer_norm.bias[FLOAT, 1024]
  %onnx::Concat_3130[INT64, 1]
  %onnx::Range_3131[INT64, scalar]
  %onnx::Range_3132[INT64, scalar]
  %onnx::Concat_3133[INT64, 1]
  %onnx::MatMul_3134[FLOAT, 1024x1024]
  %onnx::MatMul_3135[FLOAT, 1024x1024]
  %onnx::Concat_3137[INT64, 1]
  %onnx::Concat_3138[INT64, 1]
  %onnx::MatMul_3139[FLOAT, 1024x1024]
  %onnx::Concat_3154[INT64, 1]
  %onnx::MatMul_3155[FLOAT, 1024x1024]
  %onnx::MatMul_3156[FLOAT, 1024x4096]
  %onnx::MatMul_3157[FLOAT, 4096x1024]
  %onnx::MatMul_3158[FLOAT, 1024x1024]
  %onnx::MatMul_3159[FLOAT, 1024x1024]
  %onnx::MatMul_3163[FLOAT, 1024x1024]
  %onnx::MatMul_3179[FLOAT, 1024x1024]
  %onnx::MatMul_3180[FLOAT, 1024x4096]
  %onnx::MatMul_3181[FLOAT, 4096x1024]
  %onnx::MatMul_3182[FLOAT, 1024x1024]
  %onnx::MatMul_3183[FLOAT, 1024x1024]
  %onnx::MatMul_3187[FLOAT, 1024x1024]
  %onnx::MatMul_3203[FLOAT, 1024x1024]
  %onnx::MatMul_3204[FLOAT, 1024x4096]
  %onnx::MatMul_3205[FLOAT, 4096x1024]
  %onnx::MatMul_3206[FLOAT, 1024x1024]
  %onnx::MatMul_3207[FLOAT, 1024x1024]
  %onnx::MatMul_3211[FLOAT, 1024x1024]
  %onnx::MatMul_3227[FLOAT, 1024x1024]
  %onnx::MatMul_3228[FLOAT, 1024x4096]
  %onnx::MatMul_3229[FLOAT, 4096x1024]
  %onnx::MatMul_3230[FLOAT, 1024x1024]
  %onnx::MatMul_3231[FLOAT, 1024x1024]
  %onnx::MatMul_3235[FLOAT, 1024x1024]
  %onnx::MatMul_3251[FLOAT, 1024x1024]
  %onnx::MatMul_3252[FLOAT, 1024x4096]
  %onnx::MatMul_3253[FLOAT, 4096x1024]
  %onnx::MatMul_3254[FLOAT, 1024x1024]
  %onnx::MatMul_3255[FLOAT, 1024x1024]
  %onnx::MatMul_3259[FLOAT, 1024x1024]
  %onnx::MatMul_3275[FLOAT, 1024x1024]
  %onnx::MatMul_3276[FLOAT, 1024x4096]
  %onnx::MatMul_3277[FLOAT, 4096x1024]
  %onnx::MatMul_3278[FLOAT, 1024x1024]
  %onnx::MatMul_3279[FLOAT, 1024x1024]
  %onnx::MatMul_3283[FLOAT, 1024x1024]
  %onnx::MatMul_3299[FLOAT, 1024x1024]
  %onnx::MatMul_3300[FLOAT, 1024x4096]
  %onnx::MatMul_3301[FLOAT, 4096x1024]
  %onnx::MatMul_3302[FLOAT, 1024x1024]
  %onnx::MatMul_3303[FLOAT, 1024x1024]
  %onnx::MatMul_3307[FLOAT, 1024x1024]
  %onnx::MatMul_3323[FLOAT, 1024x1024]
  %onnx::MatMul_3324[FLOAT, 1024x4096]
  %onnx::MatMul_3325[FLOAT, 4096x1024]
  %onnx::MatMul_3326[FLOAT, 1024x1024]
  %onnx::MatMul_3327[FLOAT, 1024x1024]
  %onnx::MatMul_3331[FLOAT, 1024x1024]
  %onnx::MatMul_3347[FLOAT, 1024x1024]
  %onnx::MatMul_3348[FLOAT, 1024x4096]
  %onnx::MatMul_3349[FLOAT, 4096x1024]
  %onnx::MatMul_3350[FLOAT, 1024x1024]
  %onnx::MatMul_3351[FLOAT, 1024x1024]
  %onnx::MatMul_3355[FLOAT, 1024x1024]
  %onnx::MatMul_3371[FLOAT, 1024x1024]
  %onnx::MatMul_3372[FLOAT, 1024x4096]
  %onnx::MatMul_3373[FLOAT, 4096x1024]
  %onnx::MatMul_3374[FLOAT, 1024x1024]
  %onnx::MatMul_3375[FLOAT, 1024x1024]
  %onnx::MatMul_3379[FLOAT, 1024x1024]
  %onnx::MatMul_3395[FLOAT, 1024x1024]
  %onnx::MatMul_3396[FLOAT, 1024x4096]
  %onnx::MatMul_3397[FLOAT, 4096x1024]
  %onnx::MatMul_3398[FLOAT, 1024x1024]
  %onnx::MatMul_3399[FLOAT, 1024x1024]
  %onnx::MatMul_3403[FLOAT, 1024x1024]
  %onnx::MatMul_3419[FLOAT, 1024x1024]
  %onnx::MatMul_3420[FLOAT, 1024x4096]
  %onnx::MatMul_3421[FLOAT, 4096x1024]
  %onnx::MatMul_3422[FLOAT, 1024x1024]
  %onnx::MatMul_3423[FLOAT, 1024x1024]
  %onnx::MatMul_3427[FLOAT, 1024x1024]
  %onnx::MatMul_3443[FLOAT, 1024x1024]
  %onnx::MatMul_3444[FLOAT, 1024x4096]
  %onnx::MatMul_3445[FLOAT, 4096x1024]
  %onnx::MatMul_3446[FLOAT, 1024x1024]
  %onnx::MatMul_3447[FLOAT, 1024x1024]
  %onnx::MatMul_3451[FLOAT, 1024x1024]
  %onnx::MatMul_3467[FLOAT, 1024x1024]
  %onnx::MatMul_3468[FLOAT, 1024x4096]
  %onnx::MatMul_3469[FLOAT, 4096x1024]
  %onnx::MatMul_3470[FLOAT, 1024x1024]
  %onnx::MatMul_3471[FLOAT, 1024x1024]
  %onnx::MatMul_3475[FLOAT, 1024x1024]
  %onnx::MatMul_3491[FLOAT, 1024x1024]
  %onnx::MatMul_3492[FLOAT, 1024x4096]
  %onnx::MatMul_3493[FLOAT, 4096x1024]
  %onnx::MatMul_3494[FLOAT, 1024x1024]
  %onnx::MatMul_3495[FLOAT, 1024x1024]
  %onnx::MatMul_3499[FLOAT, 1024x1024]
  %onnx::MatMul_3515[FLOAT, 1024x1024]
  %onnx::MatMul_3516[FLOAT, 1024x4096]
  %onnx::MatMul_3517[FLOAT, 4096x1024]
  %onnx::Unsqueeze_268[INT64, 1]
  %onnx::Mul_273[FLOAT, scalar]
  %onnx::Sub_313[FLOAT, scalar]
  %onnx::Where_317[FLOAT, scalar]
  %onnx::Pow_321[FLOAT, scalar]
  %onnx::Add_324[FLOAT, scalar]
  %onnx::Mul_339[FLOAT, scalar]
  %onnx::Mul_375[INT64, scalar]
  %2454[INT64, 2]
  %onnx::Mul_306[INT64, 4]
  %onnx::Equal_308[INT64, 4]
) {
  %onnx::Gather_262 = Shape(%input_ids)
  %onnx::Unsqueeze_264 = Gather[axis = 0](%onnx::Gather_262, %onnx::Range_3132)
  %onnx::Concat_269 = Unsqueeze(%onnx::Unsqueeze_264, %onnx::Unsqueeze_268)
  %onnx::Reshape_270 = Concat[axis = 0](%onnx::Concat_3130, %onnx::Concat_269)
  %input = Reshape(%input_ids, %onnx::Reshape_270)
  %onnx::Mul_272 = Gather(%embed_tokens.weight, %input)
  %onnx::Add_274 = Mul(%onnx::Mul_272, %onnx::Mul_273)
  %input.3 = Range(%onnx::Range_3131, %onnx::Unsqueeze_264, %onnx::Range_3132)
  %onnx::Add_281 = Gather(%embed_positions.weight, %input.3)
  %hidden_states = Add(%onnx::Add_274, %onnx::Add_281)
  %onnx::Gather_283 = Shape(%attention_mask)
  %onnx::Unsqueeze_285 = Gather[axis = 0](%onnx::Gather_283, %onnx::Range_3131)
  %onnx::Unsqueeze_288 = Gather[axis = 0](%onnx::Gather_283, %onnx::Range_3132)
  %onnx::Expand_292 = Unsqueeze(%attention_mask, %2454)
  %onnx::Concat_295 = Unsqueeze(%onnx::Unsqueeze_285, %onnx::Unsqueeze_268)
  %onnx::Concat_299 = Unsqueeze(%onnx::Unsqueeze_288, %onnx::Unsqueeze_268)
  %onnx::Reshape_302 = Concat[axis = 0](%onnx::Concat_295, %onnx::Concat_3133, %onnx::Concat_299, %onnx::Concat_299)
  %onnx::Where_309 = Equal(%onnx::Reshape_302, %onnx::Equal_308)
  %onnx::Expand_310 = Where(%onnx::Where_309, %onnx::Mul_306, %onnx::Reshape_302)
  %onnx::Cast_311 = Expand(%onnx::Expand_292, %onnx::Expand_310)
  %onnx::Sub_312 = Cast[to = 1](%onnx::Cast_311)
  %onnx::Cast_314 = Sub(%onnx::Sub_313, %onnx::Sub_312)
  %onnx::Cast_315 = Cast[to = 9](%onnx::Cast_314)
  %onnx::Add_318 = Where(%onnx::Cast_315, %onnx::Where_317, %onnx::Cast_314)
  %onnx::Sub_319 = ReduceMean[axes = [-1]](%hidden_states)
  %onnx::Pow_320 = Sub(%hidden_states, %onnx::Sub_319)
  %onnx::ReduceMean_322 = Pow(%onnx::Pow_320, %onnx::Pow_321)
  %onnx::Add_323 = ReduceMean[axes = [-1]](%onnx::ReduceMean_322)
  %onnx::Sqrt_325 = Add(%onnx::Add_323, %onnx::Add_324)
  %onnx::Div_326 = Sqrt(%onnx::Sqrt_325)
  %onnx::Mul_327 = Div(%onnx::Pow_320, %onnx::Div_326)
  %onnx::Add_328 = Mul(%onnx::Mul_327, %layers.0.self_attn_layer_norm.weight)
  %onnx::Shape_329 = Add(%onnx::Add_328, %layers.0.self_attn_layer_norm.bias)
  %onnx::Gather_330 = Shape(%onnx::Shape_329)
  %onnx::Unsqueeze_332 = Gather[axis = 0](%onnx::Gather_330, %onnx::Range_3131)
  %onnx::Unsqueeze_335 = Gather[axis = 0](%onnx::Gather_330, %onnx::Range_3132)
  %onnx::Add_337 = MatMul(%onnx::Shape_329, %onnx::MatMul_3134)
  %onnx::Mul_338 = Add(%layers.0.self_attn.q_proj.bias, %onnx::Add_337)
  %query_states = Mul(%onnx::Mul_338, %onnx::Mul_339)
  %onnx::Add_342 = MatMul(%onnx::Shape_329, %onnx::MatMul_3135)
  %onnx::Reshape_343 = Add(%layers.0.self_attn.k_proj.bias, %onnx::Add_342)
  %onnx::Concat_348 = Unsqueeze(%onnx::Unsqueeze_332, %onnx::Unsqueeze_268)
  %onnx::Reshape_355 = Concat[axis = 0](%onnx::Concat_348, %onnx::Concat_3130, %onnx::Concat_3137, %onnx::Concat_3138)
  %onnx::Transpose_356 = Reshape(%onnx::Reshape_343, %onnx::Reshape_355)
  %onnx::Reshape_357 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_356)
  %onnx::Add_359 = MatMul(%onnx::Shape_329, %onnx::MatMul_3139)
  %onnx::Reshape_360 = Add(%layers.0.self_attn.v_proj.bias, %onnx::Add_359)
  %onnx::Transpose_373 = Reshape(%onnx::Reshape_360, %onnx::Reshape_355)
  %onnx::Reshape_374 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_373)
  %onnx::Unsqueeze_376 = Mul(%onnx::Unsqueeze_332, %onnx::Mul_375)
  %onnx::Concat_382 = Unsqueeze(%onnx::Unsqueeze_335, %onnx::Unsqueeze_268)
  %onnx::Reshape_387 = Concat[axis = 0](%onnx::Concat_348, %onnx::Concat_382, %onnx::Concat_3137, %onnx::Concat_3138)
  %onnx::Transpose_388 = Reshape(%query_states, %onnx::Reshape_387)
  %onnx::Reshape_389 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_388)
  %onnx::Concat_393 = Unsqueeze(%onnx::Unsqueeze_376, %onnx::Unsqueeze_268)
  %onnx::Reshape_398 = Concat[axis = 0](%onnx::Concat_393, %onnx::Concat_3130, %onnx::Concat_3138)
  %onnx::MatMul_399 = Reshape(%onnx::Reshape_389, %onnx::Reshape_398)
  %onnx::Shape_409 = Reshape(%onnx::Reshape_357, %onnx::Reshape_398)
  %onnx::MatMul_419 = Reshape(%onnx::Reshape_374, %onnx::Reshape_398)
  %onnx::Gather_420 = Shape(%onnx::Shape_409)
  %onnx::Unsqueeze_422 = Gather[axis = 0](%onnx::Gather_420, %onnx::Range_3132)
  %onnx::MatMul_423 = Transpose[perm = [0, 2, 1]](%onnx::Shape_409)
  %onnx::Reshape_424 = MatMul(%onnx::MatMul_399, %onnx::MatMul_423)
  %onnx::Concat_433 = Unsqueeze(%onnx::Unsqueeze_422, %onnx::Unsqueeze_268)
  %onnx::Reshape_434 = Concat[axis = 0](%onnx::Concat_348, %onnx::Concat_3137, %onnx::Concat_382, %onnx::Concat_433)
  %onnx::Add_435 = Reshape(%onnx::Reshape_424, %onnx::Reshape_434)
  %onnx::Reshape_436 = Add(%onnx::Add_435, %onnx::Add_318)
  %onnx::Reshape_445 = Concat[axis = 0](%onnx::Concat_393, %onnx::Concat_382, %onnx::Concat_433)
  %attn_weights = Reshape(%onnx::Reshape_436, %onnx::Reshape_445)
  %attn_weights.3 = Softmax[axis = -1](%attn_weights)
  %onnx::Reshape_448 = MatMul(%attn_weights.3, %onnx::MatMul_419)
  %onnx::Reshape_459 = Concat[axis = 0](%onnx::Concat_348, %onnx::Concat_3137, %onnx::Concat_382, %onnx::Concat_3138)
  %onnx::Transpose_460 = Reshape(%onnx::Reshape_448, %onnx::Reshape_459)
  %onnx::Reshape_461 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_460)
  %onnx::Reshape_469 = Concat[axis = 0](%onnx::Concat_348, %onnx::Concat_382, %onnx::Concat_3154)
  %onnx::MatMul_470 = Reshape(%onnx::Reshape_461, %onnx::Reshape_469)
  %onnx::Add_472 = MatMul(%onnx::MatMul_470, %onnx::MatMul_3155)
  %hidden_states.3 = Add(%layers.0.self_attn.out_proj.bias, %onnx::Add_472)
  %input.7 = Add(%hidden_states, %hidden_states.3)
  %onnx::Sub_475 = ReduceMean[axes = [-1]](%input.7)
  %onnx::Pow_476 = Sub(%input.7, %onnx::Sub_475)
  %onnx::ReduceMean_478 = Pow(%onnx::Pow_476, %onnx::Pow_321)
  %onnx::Add_479 = ReduceMean[axes = [-1]](%onnx::ReduceMean_478)
  %onnx::Sqrt_481 = Add(%onnx::Add_479, %onnx::Add_324)
  %onnx::Div_482 = Sqrt(%onnx::Sqrt_481)
  %onnx::Mul_483 = Div(%onnx::Pow_476, %onnx::Div_482)
  %onnx::Add_484 = Mul(%onnx::Mul_483, %layers.0.final_layer_norm.weight)
  %onnx::MatMul_485 = Add(%onnx::Add_484, %layers.0.final_layer_norm.bias)
  %onnx::Add_487 = MatMul(%onnx::MatMul_485, %onnx::MatMul_3156)
  %input.11 = Add(%layers.0.fc1.bias, %onnx::Add_487)
  %hidden_states.7 = Relu(%input.11)
  %onnx::Add_491 = MatMul(%hidden_states.7, %onnx::MatMul_3157)
  %hidden_states.11 = Add(%layers.0.fc2.bias, %onnx::Add_491)
  %input.15 = Add(%input.7, %hidden_states.11)
  %onnx::Sub_494 = ReduceMean[axes = [-1]](%input.15)
  %onnx::Pow_495 = Sub(%input.15, %onnx::Sub_494)
  %onnx::ReduceMean_497 = Pow(%onnx::Pow_495, %onnx::Pow_321)
  %onnx::Add_498 = ReduceMean[axes = [-1]](%onnx::ReduceMean_497)
  %onnx::Sqrt_500 = Add(%onnx::Add_498, %onnx::Add_324)
  %onnx::Div_501 = Sqrt(%onnx::Sqrt_500)
  %onnx::Mul_502 = Div(%onnx::Pow_495, %onnx::Div_501)
  %onnx::Add_503 = Mul(%onnx::Mul_502, %layers.1.self_attn_layer_norm.weight)
  %onnx::Shape_504 = Add(%onnx::Add_503, %layers.1.self_attn_layer_norm.bias)
  %onnx::Gather_505 = Shape(%onnx::Shape_504)
  %onnx::Unsqueeze_507 = Gather[axis = 0](%onnx::Gather_505, %onnx::Range_3131)
  %onnx::Unsqueeze_510 = Gather[axis = 0](%onnx::Gather_505, %onnx::Range_3132)
  %onnx::Add_512 = MatMul(%onnx::Shape_504, %onnx::MatMul_3158)
  %onnx::Mul_513 = Add(%layers.1.self_attn.q_proj.bias, %onnx::Add_512)
  %query_states.3 = Mul(%onnx::Mul_513, %onnx::Mul_339)
  %onnx::Add_517 = MatMul(%onnx::Shape_504, %onnx::MatMul_3159)
  %onnx::Reshape_518 = Add(%layers.1.self_attn.k_proj.bias, %onnx::Add_517)
  %onnx::Concat_523 = Unsqueeze(%onnx::Unsqueeze_507, %onnx::Unsqueeze_268)
  %onnx::Reshape_530 = Concat[axis = 0](%onnx::Concat_523, %onnx::Concat_3130, %onnx::Concat_3137, %onnx::Concat_3138)
  %onnx::Transpose_531 = Reshape(%onnx::Reshape_518, %onnx::Reshape_530)
  %onnx::Reshape_532 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_531)
  %onnx::Add_534 = MatMul(%onnx::Shape_504, %onnx::MatMul_3163)
  %onnx::Reshape_535 = Add(%layers.1.self_attn.v_proj.bias, %onnx::Add_534)
  %onnx::Transpose_548 = Reshape(%onnx::Reshape_535, %onnx::Reshape_530)
  %onnx::Reshape_549 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_548)
  %onnx::Unsqueeze_551 = Mul(%onnx::Unsqueeze_507, %onnx::Mul_375)
  %onnx::Concat_557 = Unsqueeze(%onnx::Unsqueeze_510, %onnx::Unsqueeze_268)
  %onnx::Reshape_562 = Concat[axis = 0](%onnx::Concat_523, %onnx::Concat_557, %onnx::Concat_3137, %onnx::Concat_3138)
  %onnx::Transpose_563 = Reshape(%query_states.3, %onnx::Reshape_562)
  %onnx::Reshape_564 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_563)
  %onnx::Concat_568 = Unsqueeze(%onnx::Unsqueeze_551, %onnx::Unsqueeze_268)
  %onnx::Reshape_573 = Concat[axis = 0](%onnx::Concat_568, %onnx::Concat_3130, %onnx::Concat_3138)
  %onnx::MatMul_574 = Reshape(%onnx::Reshape_564, %onnx::Reshape_573)
  %onnx::Shape_584 = Reshape(%onnx::Reshape_532, %onnx::Reshape_573)
  %onnx::MatMul_594 = Reshape(%onnx::Reshape_549, %onnx::Reshape_573)
  %onnx::Gather_595 = Shape(%onnx::Shape_584)
  %onnx::Unsqueeze_597 = Gather[axis = 0](%onnx::Gather_595, %onnx::Range_3132)
  %onnx::MatMul_598 = Transpose[perm = [0, 2, 1]](%onnx::Shape_584)
  %onnx::Reshape_599 = MatMul(%onnx::MatMul_574, %onnx::MatMul_598)
  %onnx::Concat_608 = Unsqueeze(%onnx::Unsqueeze_597, %onnx::Unsqueeze_268)
  %onnx::Reshape_609 = Concat[axis = 0](%onnx::Concat_523, %onnx::Concat_3137, %onnx::Concat_557, %onnx::Concat_608)
  %onnx::Add_610 = Reshape(%onnx::Reshape_599, %onnx::Reshape_609)
  %onnx::Reshape_611 = Add(%onnx::Add_610, %onnx::Add_318)
  %onnx::Reshape_620 = Concat[axis = 0](%onnx::Concat_568, %onnx::Concat_557, %onnx::Concat_608)
  %attn_weights.7 = Reshape(%onnx::Reshape_611, %onnx::Reshape_620)
  %attn_weights.11 = Softmax[axis = -1](%attn_weights.7)
  %onnx::Reshape_623 = MatMul(%attn_weights.11, %onnx::MatMul_594)
  %onnx::Reshape_634 = Concat[axis = 0](%onnx::Concat_523, %onnx::Concat_3137, %onnx::Concat_557, %onnx::Concat_3138)
  %onnx::Transpose_635 = Reshape(%onnx::Reshape_623, %onnx::Reshape_634)
  %onnx::Reshape_636 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_635)
  %onnx::Reshape_644 = Concat[axis = 0](%onnx::Concat_523, %onnx::Concat_557, %onnx::Concat_3154)
  %onnx::MatMul_645 = Reshape(%onnx::Reshape_636, %onnx::Reshape_644)
  %onnx::Add_647 = MatMul(%onnx::MatMul_645, %onnx::MatMul_3179)
  %hidden_states.15 = Add(%layers.1.self_attn.out_proj.bias, %onnx::Add_647)
  %input.19 = Add(%input.15, %hidden_states.15)
  %onnx::Sub_650 = ReduceMean[axes = [-1]](%input.19)
  %onnx::Pow_651 = Sub(%input.19, %onnx::Sub_650)
  %onnx::ReduceMean_653 = Pow(%onnx::Pow_651, %onnx::Pow_321)
  %onnx::Add_654 = ReduceMean[axes = [-1]](%onnx::ReduceMean_653)
  %onnx::Sqrt_656 = Add(%onnx::Add_654, %onnx::Add_324)
  %onnx::Div_657 = Sqrt(%onnx::Sqrt_656)
  %onnx::Mul_658 = Div(%onnx::Pow_651, %onnx::Div_657)
  %onnx::Add_659 = Mul(%onnx::Mul_658, %layers.1.final_layer_norm.weight)
  %onnx::MatMul_660 = Add(%onnx::Add_659, %layers.1.final_layer_norm.bias)
  %onnx::Add_662 = MatMul(%onnx::MatMul_660, %onnx::MatMul_3180)
  %input.23 = Add(%layers.1.fc1.bias, %onnx::Add_662)
  %hidden_states.19 = Relu(%input.23)
  %onnx::Add_666 = MatMul(%hidden_states.19, %onnx::MatMul_3181)
  %hidden_states.23 = Add(%layers.1.fc2.bias, %onnx::Add_666)
  %input.27 = Add(%input.19, %hidden_states.23)
  %onnx::Sub_669 = ReduceMean[axes = [-1]](%input.27)
  %onnx::Pow_670 = Sub(%input.27, %onnx::Sub_669)
  %onnx::ReduceMean_672 = Pow(%onnx::Pow_670, %onnx::Pow_321)
  %onnx::Add_673 = ReduceMean[axes = [-1]](%onnx::ReduceMean_672)
  %onnx::Sqrt_675 = Add(%onnx::Add_673, %onnx::Add_324)
  %onnx::Div_676 = Sqrt(%onnx::Sqrt_675)
  %onnx::Mul_677 = Div(%onnx::Pow_670, %onnx::Div_676)
  %onnx::Add_678 = Mul(%onnx::Mul_677, %layers.2.self_attn_layer_norm.weight)
  %onnx::Shape_679 = Add(%onnx::Add_678, %layers.2.self_attn_layer_norm.bias)
  %onnx::Gather_680 = Shape(%onnx::Shape_679)
  %onnx::Unsqueeze_682 = Gather[axis = 0](%onnx::Gather_680, %onnx::Range_3131)
  %onnx::Unsqueeze_685 = Gather[axis = 0](%onnx::Gather_680, %onnx::Range_3132)
  %onnx::Add_687 = MatMul(%onnx::Shape_679, %onnx::MatMul_3182)
  %onnx::Mul_688 = Add(%layers.2.self_attn.q_proj.bias, %onnx::Add_687)
  %query_states.7 = Mul(%onnx::Mul_688, %onnx::Mul_339)
  %onnx::Add_692 = MatMul(%onnx::Shape_679, %onnx::MatMul_3183)
  %onnx::Reshape_693 = Add(%layers.2.self_attn.k_proj.bias, %onnx::Add_692)
  %onnx::Concat_698 = Unsqueeze(%onnx::Unsqueeze_682, %onnx::Unsqueeze_268)
  %onnx::Reshape_705 = Concat[axis = 0](%onnx::Concat_698, %onnx::Concat_3130, %onnx::Concat_3137, %onnx::Concat_3138)
  %onnx::Transpose_706 = Reshape(%onnx::Reshape_693, %onnx::Reshape_705)
  %onnx::Reshape_707 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_706)
  %onnx::Add_709 = MatMul(%onnx::Shape_679, %onnx::MatMul_3187)
  %onnx::Reshape_710 = Add(%layers.2.self_attn.v_proj.bias, %onnx::Add_709)
  %onnx::Transpose_723 = Reshape(%onnx::Reshape_710, %onnx::Reshape_705)
  %onnx::Reshape_724 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_723)
  %onnx::Unsqueeze_726 = Mul(%onnx::Unsqueeze_682, %onnx::Mul_375)
  %onnx::Concat_732 = Unsqueeze(%onnx::Unsqueeze_685, %onnx::Unsqueeze_268)
  %onnx::Reshape_737 = Concat[axis = 0](%onnx::Concat_698, %onnx::Concat_732, %onnx::Concat_3137, %onnx::Concat_3138)
  %onnx::Transpose_738 = Reshape(%query_states.7, %onnx::Reshape_737)
  %onnx::Reshape_739 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_738)
  %onnx::Concat_743 = Unsqueeze(%onnx::Unsqueeze_726, %onnx::Unsqueeze_268)
  %onnx::Reshape_748 = Concat[axis = 0](%onnx::Concat_743, %onnx::Concat_3130, %onnx::Concat_3138)
  %onnx::MatMul_749 = Reshape(%onnx::Reshape_739, %onnx::Reshape_748)
  %onnx::Shape_759 = Reshape(%onnx::Reshape_707, %onnx::Reshape_748)
  %onnx::MatMul_769 = Reshape(%onnx::Reshape_724, %onnx::Reshape_748)
  %onnx::Gather_770 = Shape(%onnx::Shape_759)
  %onnx::Unsqueeze_772 = Gather[axis = 0](%onnx::Gather_770, %onnx::Range_3132)
  %onnx::MatMul_773 = Transpose[perm = [0, 2, 1]](%onnx::Shape_759)
  %onnx::Reshape_774 = MatMul(%onnx::MatMul_749, %onnx::MatMul_773)
  %onnx::Concat_783 = Unsqueeze(%onnx::Unsqueeze_772, %onnx::Unsqueeze_268)
  %onnx::Reshape_784 = Concat[axis = 0](%onnx::Concat_698, %onnx::Concat_3137, %onnx::Concat_732, %onnx::Concat_783)
  %onnx::Add_785 = Reshape(%onnx::Reshape_774, %onnx::Reshape_784)
  %onnx::Reshape_786 = Add(%onnx::Add_785, %onnx::Add_318)
  %onnx::Reshape_795 = Concat[axis = 0](%onnx::Concat_743, %onnx::Concat_732, %onnx::Concat_783)
  %attn_weights.15 = Reshape(%onnx::Reshape_786, %onnx::Reshape_795)
  %attn_weights.19 = Softmax[axis = -1](%attn_weights.15)
  %onnx::Reshape_798 = MatMul(%attn_weights.19, %onnx::MatMul_769)
  %onnx::Reshape_809 = Concat[axis = 0](%onnx::Concat_698, %onnx::Concat_3137, %onnx::Concat_732, %onnx::Concat_3138)
  %onnx::Transpose_810 = Reshape(%onnx::Reshape_798, %onnx::Reshape_809)
  %onnx::Reshape_811 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_810)
  %onnx::Reshape_819 = Concat[axis = 0](%onnx::Concat_698, %onnx::Concat_732, %onnx::Concat_3154)
  %onnx::MatMul_820 = Reshape(%onnx::Reshape_811, %onnx::Reshape_819)
  %onnx::Add_822 = MatMul(%onnx::MatMul_820, %onnx::MatMul_3203)
  %hidden_states.27 = Add(%layers.2.self_attn.out_proj.bias, %onnx::Add_822)
  %input.31 = Add(%input.27, %hidden_states.27)
  %onnx::Sub_825 = ReduceMean[axes = [-1]](%input.31)
  %onnx::Pow_826 = Sub(%input.31, %onnx::Sub_825)
  %onnx::ReduceMean_828 = Pow(%onnx::Pow_826, %onnx::Pow_321)
  %onnx::Add_829 = ReduceMean[axes = [-1]](%onnx::ReduceMean_828)
  %onnx::Sqrt_831 = Add(%onnx::Add_829, %onnx::Add_324)
  %onnx::Div_832 = Sqrt(%onnx::Sqrt_831)
  %onnx::Mul_833 = Div(%onnx::Pow_826, %onnx::Div_832)
  %onnx::Add_834 = Mul(%onnx::Mul_833, %layers.2.final_layer_norm.weight)
  %onnx::MatMul_835 = Add(%onnx::Add_834, %layers.2.final_layer_norm.bias)
  %onnx::Add_837 = MatMul(%onnx::MatMul_835, %onnx::MatMul_3204)
  %input.35 = Add(%layers.2.fc1.bias, %onnx::Add_837)
  %hidden_states.31 = Relu(%input.35)
  %onnx::Add_841 = MatMul(%hidden_states.31, %onnx::MatMul_3205)
  %hidden_states.35 = Add(%layers.2.fc2.bias, %onnx::Add_841)
  %input.39 = Add(%input.31, %hidden_states.35)
  %onnx::Sub_844 = ReduceMean[axes = [-1]](%input.39)
  %onnx::Pow_845 = Sub(%input.39, %onnx::Sub_844)
  %onnx::ReduceMean_847 = Pow(%onnx::Pow_845, %onnx::Pow_321)
  %onnx::Add_848 = ReduceMean[axes = [-1]](%onnx::ReduceMean_847)
  %onnx::Sqrt_850 = Add(%onnx::Add_848, %onnx::Add_324)
  %onnx::Div_851 = Sqrt(%onnx::Sqrt_850)
  %onnx::Mul_852 = Div(%onnx::Pow_845, %onnx::Div_851)
  %onnx::Add_853 = Mul(%onnx::Mul_852, %layers.3.self_attn_layer_norm.weight)
  %onnx::Shape_854 = Add(%onnx::Add_853, %layers.3.self_attn_layer_norm.bias)
  %onnx::Gather_855 = Shape(%onnx::Shape_854)
  %onnx::Unsqueeze_857 = Gather[axis = 0](%onnx::Gather_855, %onnx::Range_3131)
  %onnx::Unsqueeze_860 = Gather[axis = 0](%onnx::Gather_855, %onnx::Range_3132)
  %onnx::Add_862 = MatMul(%onnx::Shape_854, %onnx::MatMul_3206)
  %onnx::Mul_863 = Add(%layers.3.self_attn.q_proj.bias, %onnx::Add_862)
  %query_states.11 = Mul(%onnx::Mul_863, %onnx::Mul_339)
  %onnx::Add_867 = MatMul(%onnx::Shape_854, %onnx::MatMul_3207)
  %onnx::Reshape_868 = Add(%layers.3.self_attn.k_proj.bias, %onnx::Add_867)
  %onnx::Concat_873 = Unsqueeze(%onnx::Unsqueeze_857, %onnx::Unsqueeze_268)
  %onnx::Reshape_880 = Concat[axis = 0](%onnx::Concat_873, %onnx::Concat_3130, %onnx::Concat_3137, %onnx::Concat_3138)
  %onnx::Transpose_881 = Reshape(%onnx::Reshape_868, %onnx::Reshape_880)
  %onnx::Reshape_882 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_881)
  %onnx::Add_884 = MatMul(%onnx::Shape_854, %onnx::MatMul_3211)
  %onnx::Reshape_885 = Add(%layers.3.self_attn.v_proj.bias, %onnx::Add_884)
  %onnx::Transpose_898 = Reshape(%onnx::Reshape_885, %onnx::Reshape_880)
  %onnx::Reshape_899 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_898)
  %onnx::Unsqueeze_901 = Mul(%onnx::Unsqueeze_857, %onnx::Mul_375)
  %onnx::Concat_907 = Unsqueeze(%onnx::Unsqueeze_860, %onnx::Unsqueeze_268)
  %onnx::Reshape_912 = Concat[axis = 0](%onnx::Concat_873, %onnx::Concat_907, %onnx::Concat_3137, %onnx::Concat_3138)
  %onnx::Transpose_913 = Reshape(%query_states.11, %onnx::Reshape_912)
  %onnx::Reshape_914 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_913)
  %onnx::Concat_918 = Unsqueeze(%onnx::Unsqueeze_901, %onnx::Unsqueeze_268)
  %onnx::Reshape_923 = Concat[axis = 0](%onnx::Concat_918, %onnx::Concat_3130, %onnx::Concat_3138)
  %onnx::MatMul_924 = Reshape(%onnx::Reshape_914, %onnx::Reshape_923)
  %onnx::Shape_934 = Reshape(%onnx::Reshape_882, %onnx::Reshape_923)
  %onnx::MatMul_944 = Reshape(%onnx::Reshape_899, %onnx::Reshape_923)
  %onnx::Gather_945 = Shape(%onnx::Shape_934)
  %onnx::Unsqueeze_947 = Gather[axis = 0](%onnx::Gather_945, %onnx::Range_3132)
  %onnx::MatMul_948 = Transpose[perm = [0, 2, 1]](%onnx::Shape_934)
  %onnx::Reshape_949 = MatMul(%onnx::MatMul_924, %onnx::MatMul_948)
  %onnx::Concat_958 = Unsqueeze(%onnx::Unsqueeze_947, %onnx::Unsqueeze_268)
  %onnx::Reshape_959 = Concat[axis = 0](%onnx::Concat_873, %onnx::Concat_3137, %onnx::Concat_907, %onnx::Concat_958)
  %onnx::Add_960 = Reshape(%onnx::Reshape_949, %onnx::Reshape_959)
  %onnx::Reshape_961 = Add(%onnx::Add_960, %onnx::Add_318)
  %onnx::Reshape_970 = Concat[axis = 0](%onnx::Concat_918, %onnx::Concat_907, %onnx::Concat_958)
  %attn_weights.23 = Reshape(%onnx::Reshape_961, %onnx::Reshape_970)
  %attn_weights.27 = Softmax[axis = -1](%attn_weights.23)
  %onnx::Reshape_973 = MatMul(%attn_weights.27, %onnx::MatMul_944)
  %onnx::Reshape_984 = Concat[axis = 0](%onnx::Concat_873, %onnx::Concat_3137, %onnx::Concat_907, %onnx::Concat_3138)
  %onnx::Transpose_985 = Reshape(%onnx::Reshape_973, %onnx::Reshape_984)
  %onnx::Reshape_986 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_985)
  %onnx::Reshape_994 = Concat[axis = 0](%onnx::Concat_873, %onnx::Concat_907, %onnx::Concat_3154)
  %onnx::MatMul_995 = Reshape(%onnx::Reshape_986, %onnx::Reshape_994)
  %onnx::Add_997 = MatMul(%onnx::MatMul_995, %onnx::MatMul_3227)
  %hidden_states.39 = Add(%layers.3.self_attn.out_proj.bias, %onnx::Add_997)
  %input.43 = Add(%input.39, %hidden_states.39)
  %onnx::Sub_1000 = ReduceMean[axes = [-1]](%input.43)
  %onnx::Pow_1001 = Sub(%input.43, %onnx::Sub_1000)
  %onnx::ReduceMean_1003 = Pow(%onnx::Pow_1001, %onnx::Pow_321)
  %onnx::Add_1004 = ReduceMean[axes = [-1]](%onnx::ReduceMean_1003)
  %onnx::Sqrt_1006 = Add(%onnx::Add_1004, %onnx::Add_324)
  %onnx::Div_1007 = Sqrt(%onnx::Sqrt_1006)
  %onnx::Mul_1008 = Div(%onnx::Pow_1001, %onnx::Div_1007)
  %onnx::Add_1009 = Mul(%onnx::Mul_1008, %layers.3.final_layer_norm.weight)
  %onnx::MatMul_1010 = Add(%onnx::Add_1009, %layers.3.final_layer_norm.bias)
  %onnx::Add_1012 = MatMul(%onnx::MatMul_1010, %onnx::MatMul_3228)
  %input.47 = Add(%layers.3.fc1.bias, %onnx::Add_1012)
  %hidden_states.43 = Relu(%input.47)
  %onnx::Add_1016 = MatMul(%hidden_states.43, %onnx::MatMul_3229)
  %hidden_states.47 = Add(%layers.3.fc2.bias, %onnx::Add_1016)
  %input.51 = Add(%input.43, %hidden_states.47)
  %onnx::Sub_1019 = ReduceMean[axes = [-1]](%input.51)
  %onnx::Pow_1020 = Sub(%input.51, %onnx::Sub_1019)
  %onnx::ReduceMean_1022 = Pow(%onnx::Pow_1020, %onnx::Pow_321)
  %onnx::Add_1023 = ReduceMean[axes = [-1]](%onnx::ReduceMean_1022)
  %onnx::Sqrt_1025 = Add(%onnx::Add_1023, %onnx::Add_324)
  %onnx::Div_1026 = Sqrt(%onnx::Sqrt_1025)
  %onnx::Mul_1027 = Div(%onnx::Pow_1020, %onnx::Div_1026)
  %onnx::Add_1028 = Mul(%onnx::Mul_1027, %layers.4.self_attn_layer_norm.weight)
  %onnx::Shape_1029 = Add(%onnx::Add_1028, %layers.4.self_attn_layer_norm.bias)
  %onnx::Gather_1030 = Shape(%onnx::Shape_1029)
  %onnx::Unsqueeze_1032 = Gather[axis = 0](%onnx::Gather_1030, %onnx::Range_3131)
  %onnx::Unsqueeze_1035 = Gather[axis = 0](%onnx::Gather_1030, %onnx::Range_3132)
  %onnx::Add_1037 = MatMul(%onnx::Shape_1029, %onnx::MatMul_3230)
  %onnx::Mul_1038 = Add(%layers.4.self_attn.q_proj.bias, %onnx::Add_1037)
  %query_states.15 = Mul(%onnx::Mul_1038, %onnx::Mul_339)
  %onnx::Add_1042 = MatMul(%onnx::Shape_1029, %onnx::MatMul_3231)
  %onnx::Reshape_1043 = Add(%layers.4.self_attn.k_proj.bias, %onnx::Add_1042)
  %onnx::Concat_1048 = Unsqueeze(%onnx::Unsqueeze_1032, %onnx::Unsqueeze_268)
  %onnx::Reshape_1055 = Concat[axis = 0](%onnx::Concat_1048, %onnx::Concat_3130, %onnx::Concat_3137, %onnx::Concat_3138)
  %onnx::Transpose_1056 = Reshape(%onnx::Reshape_1043, %onnx::Reshape_1055)
  %onnx::Reshape_1057 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_1056)
  %onnx::Add_1059 = MatMul(%onnx::Shape_1029, %onnx::MatMul_3235)
  %onnx::Reshape_1060 = Add(%layers.4.self_attn.v_proj.bias, %onnx::Add_1059)
  %onnx::Transpose_1073 = Reshape(%onnx::Reshape_1060, %onnx::Reshape_1055)
  %onnx::Reshape_1074 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_1073)
  %onnx::Unsqueeze_1076 = Mul(%onnx::Unsqueeze_1032, %onnx::Mul_375)
  %onnx::Concat_1082 = Unsqueeze(%onnx::Unsqueeze_1035, %onnx::Unsqueeze_268)
  %onnx::Reshape_1087 = Concat[axis = 0](%onnx::Concat_1048, %onnx::Concat_1082, %onnx::Concat_3137, %onnx::Concat_3138)
  %onnx::Transpose_1088 = Reshape(%query_states.15, %onnx::Reshape_1087)
  %onnx::Reshape_1089 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_1088)
  %onnx::Concat_1093 = Unsqueeze(%onnx::Unsqueeze_1076, %onnx::Unsqueeze_268)
  %onnx::Reshape_1098 = Concat[axis = 0](%onnx::Concat_1093, %onnx::Concat_3130, %onnx::Concat_3138)
  %onnx::MatMul_1099 = Reshape(%onnx::Reshape_1089, %onnx::Reshape_1098)
  %onnx::Shape_1109 = Reshape(%onnx::Reshape_1057, %onnx::Reshape_1098)
  %onnx::MatMul_1119 = Reshape(%onnx::Reshape_1074, %onnx::Reshape_1098)
  %onnx::Gather_1120 = Shape(%onnx::Shape_1109)
  %onnx::Unsqueeze_1122 = Gather[axis = 0](%onnx::Gather_1120, %onnx::Range_3132)
  %onnx::MatMul_1123 = Transpose[perm = [0, 2, 1]](%onnx::Shape_1109)
  %onnx::Reshape_1124 = MatMul(%onnx::MatMul_1099, %onnx::MatMul_1123)
  %onnx::Concat_1133 = Unsqueeze(%onnx::Unsqueeze_1122, %onnx::Unsqueeze_268)
  %onnx::Reshape_1134 = Concat[axis = 0](%onnx::Concat_1048, %onnx::Concat_3137, %onnx::Concat_1082, %onnx::Concat_1133)
  %onnx::Add_1135 = Reshape(%onnx::Reshape_1124, %onnx::Reshape_1134)
  %onnx::Reshape_1136 = Add(%onnx::Add_1135, %onnx::Add_318)
  %onnx::Reshape_1145 = Concat[axis = 0](%onnx::Concat_1093, %onnx::Concat_1082, %onnx::Concat_1133)
  %attn_weights.31 = Reshape(%onnx::Reshape_1136, %onnx::Reshape_1145)
  %attn_weights.35 = Softmax[axis = -1](%attn_weights.31)
  %onnx::Reshape_1148 = MatMul(%attn_weights.35, %onnx::MatMul_1119)
  %onnx::Reshape_1159 = Concat[axis = 0](%onnx::Concat_1048, %onnx::Concat_3137, %onnx::Concat_1082, %onnx::Concat_3138)
  %onnx::Transpose_1160 = Reshape(%onnx::Reshape_1148, %onnx::Reshape_1159)
  %onnx::Reshape_1161 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_1160)
  %onnx::Reshape_1169 = Concat[axis = 0](%onnx::Concat_1048, %onnx::Concat_1082, %onnx::Concat_3154)
  %onnx::MatMul_1170 = Reshape(%onnx::Reshape_1161, %onnx::Reshape_1169)
  %onnx::Add_1172 = MatMul(%onnx::MatMul_1170, %onnx::MatMul_3251)
  %hidden_states.51 = Add(%layers.4.self_attn.out_proj.bias, %onnx::Add_1172)
  %input.55 = Add(%input.51, %hidden_states.51)
  %onnx::Sub_1175 = ReduceMean[axes = [-1]](%input.55)
  %onnx::Pow_1176 = Sub(%input.55, %onnx::Sub_1175)
  %onnx::ReduceMean_1178 = Pow(%onnx::Pow_1176, %onnx::Pow_321)
  %onnx::Add_1179 = ReduceMean[axes = [-1]](%onnx::ReduceMean_1178)
  %onnx::Sqrt_1181 = Add(%onnx::Add_1179, %onnx::Add_324)
  %onnx::Div_1182 = Sqrt(%onnx::Sqrt_1181)
  %onnx::Mul_1183 = Div(%onnx::Pow_1176, %onnx::Div_1182)
  %onnx::Add_1184 = Mul(%onnx::Mul_1183, %layers.4.final_layer_norm.weight)
  %onnx::MatMul_1185 = Add(%onnx::Add_1184, %layers.4.final_layer_norm.bias)
  %onnx::Add_1187 = MatMul(%onnx::MatMul_1185, %onnx::MatMul_3252)
  %input.59 = Add(%layers.4.fc1.bias, %onnx::Add_1187)
  %hidden_states.55 = Relu(%input.59)
  %onnx::Add_1191 = MatMul(%hidden_states.55, %onnx::MatMul_3253)
  %hidden_states.59 = Add(%layers.4.fc2.bias, %onnx::Add_1191)
  %input.63 = Add(%input.55, %hidden_states.59)
  %onnx::Sub_1194 = ReduceMean[axes = [-1]](%input.63)
  %onnx::Pow_1195 = Sub(%input.63, %onnx::Sub_1194)
  %onnx::ReduceMean_1197 = Pow(%onnx::Pow_1195, %onnx::Pow_321)
  %onnx::Add_1198 = ReduceMean[axes = [-1]](%onnx::ReduceMean_1197)
  %onnx::Sqrt_1200 = Add(%onnx::Add_1198, %onnx::Add_324)
  %onnx::Div_1201 = Sqrt(%onnx::Sqrt_1200)
  %onnx::Mul_1202 = Div(%onnx::Pow_1195, %onnx::Div_1201)
  %onnx::Add_1203 = Mul(%onnx::Mul_1202, %layers.5.self_attn_layer_norm.weight)
  %onnx::Shape_1204 = Add(%onnx::Add_1203, %layers.5.self_attn_layer_norm.bias)
  %onnx::Gather_1205 = Shape(%onnx::Shape_1204)
  %onnx::Unsqueeze_1207 = Gather[axis = 0](%onnx::Gather_1205, %onnx::Range_3131)
  %onnx::Unsqueeze_1210 = Gather[axis = 0](%onnx::Gather_1205, %onnx::Range_3132)
  %onnx::Add_1212 = MatMul(%onnx::Shape_1204, %onnx::MatMul_3254)
  %onnx::Mul_1213 = Add(%layers.5.self_attn.q_proj.bias, %onnx::Add_1212)
  %query_states.19 = Mul(%onnx::Mul_1213, %onnx::Mul_339)
  %onnx::Add_1217 = MatMul(%onnx::Shape_1204, %onnx::MatMul_3255)
  %onnx::Reshape_1218 = Add(%layers.5.self_attn.k_proj.bias, %onnx::Add_1217)
  %onnx::Concat_1223 = Unsqueeze(%onnx::Unsqueeze_1207, %onnx::Unsqueeze_268)
  %onnx::Reshape_1230 = Concat[axis = 0](%onnx::Concat_1223, %onnx::Concat_3130, %onnx::Concat_3137, %onnx::Concat_3138)
  %onnx::Transpose_1231 = Reshape(%onnx::Reshape_1218, %onnx::Reshape_1230)
  %onnx::Reshape_1232 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_1231)
  %onnx::Add_1234 = MatMul(%onnx::Shape_1204, %onnx::MatMul_3259)
  %onnx::Reshape_1235 = Add(%layers.5.self_attn.v_proj.bias, %onnx::Add_1234)
  %onnx::Transpose_1248 = Reshape(%onnx::Reshape_1235, %onnx::Reshape_1230)
  %onnx::Reshape_1249 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_1248)
  %onnx::Unsqueeze_1251 = Mul(%onnx::Unsqueeze_1207, %onnx::Mul_375)
  %onnx::Concat_1257 = Unsqueeze(%onnx::Unsqueeze_1210, %onnx::Unsqueeze_268)
  %onnx::Reshape_1262 = Concat[axis = 0](%onnx::Concat_1223, %onnx::Concat_1257, %onnx::Concat_3137, %onnx::Concat_3138)
  %onnx::Transpose_1263 = Reshape(%query_states.19, %onnx::Reshape_1262)
  %onnx::Reshape_1264 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_1263)
  %onnx::Concat_1268 = Unsqueeze(%onnx::Unsqueeze_1251, %onnx::Unsqueeze_268)
  %onnx::Reshape_1273 = Concat[axis = 0](%onnx::Concat_1268, %onnx::Concat_3130, %onnx::Concat_3138)
  %onnx::MatMul_1274 = Reshape(%onnx::Reshape_1264, %onnx::Reshape_1273)
  %onnx::Shape_1284 = Reshape(%onnx::Reshape_1232, %onnx::Reshape_1273)
  %onnx::MatMul_1294 = Reshape(%onnx::Reshape_1249, %onnx::Reshape_1273)
  %onnx::Gather_1295 = Shape(%onnx::Shape_1284)
  %onnx::Unsqueeze_1297 = Gather[axis = 0](%onnx::Gather_1295, %onnx::Range_3132)
  %onnx::MatMul_1298 = Transpose[perm = [0, 2, 1]](%onnx::Shape_1284)
  %onnx::Reshape_1299 = MatMul(%onnx::MatMul_1274, %onnx::MatMul_1298)
  %onnx::Concat_1308 = Unsqueeze(%onnx::Unsqueeze_1297, %onnx::Unsqueeze_268)
  %onnx::Reshape_1309 = Concat[axis = 0](%onnx::Concat_1223, %onnx::Concat_3137, %onnx::Concat_1257, %onnx::Concat_1308)
  %onnx::Add_1310 = Reshape(%onnx::Reshape_1299, %onnx::Reshape_1309)
  %onnx::Reshape_1311 = Add(%onnx::Add_1310, %onnx::Add_318)
  %onnx::Reshape_1320 = Concat[axis = 0](%onnx::Concat_1268, %onnx::Concat_1257, %onnx::Concat_1308)
  %attn_weights.39 = Reshape(%onnx::Reshape_1311, %onnx::Reshape_1320)
  %attn_weights.43 = Softmax[axis = -1](%attn_weights.39)
  %onnx::Reshape_1323 = MatMul(%attn_weights.43, %onnx::MatMul_1294)
  %onnx::Reshape_1334 = Concat[axis = 0](%onnx::Concat_1223, %onnx::Concat_3137, %onnx::Concat_1257, %onnx::Concat_3138)
  %onnx::Transpose_1335 = Reshape(%onnx::Reshape_1323, %onnx::Reshape_1334)
  %onnx::Reshape_1336 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_1335)
  %onnx::Reshape_1344 = Concat[axis = 0](%onnx::Concat_1223, %onnx::Concat_1257, %onnx::Concat_3154)
  %onnx::MatMul_1345 = Reshape(%onnx::Reshape_1336, %onnx::Reshape_1344)
  %onnx::Add_1347 = MatMul(%onnx::MatMul_1345, %onnx::MatMul_3275)
  %hidden_states.63 = Add(%layers.5.self_attn.out_proj.bias, %onnx::Add_1347)
  %input.67 = Add(%input.63, %hidden_states.63)
  %onnx::Sub_1350 = ReduceMean[axes = [-1]](%input.67)
  %onnx::Pow_1351 = Sub(%input.67, %onnx::Sub_1350)
  %onnx::ReduceMean_1353 = Pow(%onnx::Pow_1351, %onnx::Pow_321)
  %onnx::Add_1354 = ReduceMean[axes = [-1]](%onnx::ReduceMean_1353)
  %onnx::Sqrt_1356 = Add(%onnx::Add_1354, %onnx::Add_324)
  %onnx::Div_1357 = Sqrt(%onnx::Sqrt_1356)
  %onnx::Mul_1358 = Div(%onnx::Pow_1351, %onnx::Div_1357)
  %onnx::Add_1359 = Mul(%onnx::Mul_1358, %layers.5.final_layer_norm.weight)
  %onnx::MatMul_1360 = Add(%onnx::Add_1359, %layers.5.final_layer_norm.bias)
  %onnx::Add_1362 = MatMul(%onnx::MatMul_1360, %onnx::MatMul_3276)
  %input.71 = Add(%layers.5.fc1.bias, %onnx::Add_1362)
  %hidden_states.67 = Relu(%input.71)
  %onnx::Add_1366 = MatMul(%hidden_states.67, %onnx::MatMul_3277)
  %hidden_states.71 = Add(%layers.5.fc2.bias, %onnx::Add_1366)
  %input.75 = Add(%input.67, %hidden_states.71)
  %onnx::Sub_1369 = ReduceMean[axes = [-1]](%input.75)
  %onnx::Pow_1370 = Sub(%input.75, %onnx::Sub_1369)
  %onnx::ReduceMean_1372 = Pow(%onnx::Pow_1370, %onnx::Pow_321)
  %onnx::Add_1373 = ReduceMean[axes = [-1]](%onnx::ReduceMean_1372)
  %onnx::Sqrt_1375 = Add(%onnx::Add_1373, %onnx::Add_324)
  %onnx::Div_1376 = Sqrt(%onnx::Sqrt_1375)
  %onnx::Mul_1377 = Div(%onnx::Pow_1370, %onnx::Div_1376)
  %onnx::Add_1378 = Mul(%onnx::Mul_1377, %layers.6.self_attn_layer_norm.weight)
  %onnx::Shape_1379 = Add(%onnx::Add_1378, %layers.6.self_attn_layer_norm.bias)
  %onnx::Gather_1380 = Shape(%onnx::Shape_1379)
  %onnx::Unsqueeze_1382 = Gather[axis = 0](%onnx::Gather_1380, %onnx::Range_3131)
  %onnx::Unsqueeze_1385 = Gather[axis = 0](%onnx::Gather_1380, %onnx::Range_3132)
  %onnx::Add_1387 = MatMul(%onnx::Shape_1379, %onnx::MatMul_3278)
  %onnx::Mul_1388 = Add(%layers.6.self_attn.q_proj.bias, %onnx::Add_1387)
  %query_states.23 = Mul(%onnx::Mul_1388, %onnx::Mul_339)
  %onnx::Add_1392 = MatMul(%onnx::Shape_1379, %onnx::MatMul_3279)
  %onnx::Reshape_1393 = Add(%layers.6.self_attn.k_proj.bias, %onnx::Add_1392)
  %onnx::Concat_1398 = Unsqueeze(%onnx::Unsqueeze_1382, %onnx::Unsqueeze_268)
  %onnx::Reshape_1405 = Concat[axis = 0](%onnx::Concat_1398, %onnx::Concat_3130, %onnx::Concat_3137, %onnx::Concat_3138)
  %onnx::Transpose_1406 = Reshape(%onnx::Reshape_1393, %onnx::Reshape_1405)
  %onnx::Reshape_1407 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_1406)
  %onnx::Add_1409 = MatMul(%onnx::Shape_1379, %onnx::MatMul_3283)
  %onnx::Reshape_1410 = Add(%layers.6.self_attn.v_proj.bias, %onnx::Add_1409)
  %onnx::Transpose_1423 = Reshape(%onnx::Reshape_1410, %onnx::Reshape_1405)
  %onnx::Reshape_1424 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_1423)
  %onnx::Unsqueeze_1426 = Mul(%onnx::Unsqueeze_1382, %onnx::Mul_375)
  %onnx::Concat_1432 = Unsqueeze(%onnx::Unsqueeze_1385, %onnx::Unsqueeze_268)
  %onnx::Reshape_1437 = Concat[axis = 0](%onnx::Concat_1398, %onnx::Concat_1432, %onnx::Concat_3137, %onnx::Concat_3138)
  %onnx::Transpose_1438 = Reshape(%query_states.23, %onnx::Reshape_1437)
  %onnx::Reshape_1439 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_1438)
  %onnx::Concat_1443 = Unsqueeze(%onnx::Unsqueeze_1426, %onnx::Unsqueeze_268)
  %onnx::Reshape_1448 = Concat[axis = 0](%onnx::Concat_1443, %onnx::Concat_3130, %onnx::Concat_3138)
  %onnx::MatMul_1449 = Reshape(%onnx::Reshape_1439, %onnx::Reshape_1448)
  %onnx::Shape_1459 = Reshape(%onnx::Reshape_1407, %onnx::Reshape_1448)
  %onnx::MatMul_1469 = Reshape(%onnx::Reshape_1424, %onnx::Reshape_1448)
  %onnx::Gather_1470 = Shape(%onnx::Shape_1459)
  %onnx::Unsqueeze_1472 = Gather[axis = 0](%onnx::Gather_1470, %onnx::Range_3132)
  %onnx::MatMul_1473 = Transpose[perm = [0, 2, 1]](%onnx::Shape_1459)
  %onnx::Reshape_1474 = MatMul(%onnx::MatMul_1449, %onnx::MatMul_1473)
  %onnx::Concat_1483 = Unsqueeze(%onnx::Unsqueeze_1472, %onnx::Unsqueeze_268)
  %onnx::Reshape_1484 = Concat[axis = 0](%onnx::Concat_1398, %onnx::Concat_3137, %onnx::Concat_1432, %onnx::Concat_1483)
  %onnx::Add_1485 = Reshape(%onnx::Reshape_1474, %onnx::Reshape_1484)
  %onnx::Reshape_1486 = Add(%onnx::Add_1485, %onnx::Add_318)
  %onnx::Reshape_1495 = Concat[axis = 0](%onnx::Concat_1443, %onnx::Concat_1432, %onnx::Concat_1483)
  %attn_weights.47 = Reshape(%onnx::Reshape_1486, %onnx::Reshape_1495)
  %attn_weights.51 = Softmax[axis = -1](%attn_weights.47)
  %onnx::Reshape_1498 = MatMul(%attn_weights.51, %onnx::MatMul_1469)
  %onnx::Reshape_1509 = Concat[axis = 0](%onnx::Concat_1398, %onnx::Concat_3137, %onnx::Concat_1432, %onnx::Concat_3138)
  %onnx::Transpose_1510 = Reshape(%onnx::Reshape_1498, %onnx::Reshape_1509)
  %onnx::Reshape_1511 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_1510)
  %onnx::Reshape_1519 = Concat[axis = 0](%onnx::Concat_1398, %onnx::Concat_1432, %onnx::Concat_3154)
  %onnx::MatMul_1520 = Reshape(%onnx::Reshape_1511, %onnx::Reshape_1519)
  %onnx::Add_1522 = MatMul(%onnx::MatMul_1520, %onnx::MatMul_3299)
  %hidden_states.75 = Add(%layers.6.self_attn.out_proj.bias, %onnx::Add_1522)
  %input.79 = Add(%input.75, %hidden_states.75)
  %onnx::Sub_1525 = ReduceMean[axes = [-1]](%input.79)
  %onnx::Pow_1526 = Sub(%input.79, %onnx::Sub_1525)
  %onnx::ReduceMean_1528 = Pow(%onnx::Pow_1526, %onnx::Pow_321)
  %onnx::Add_1529 = ReduceMean[axes = [-1]](%onnx::ReduceMean_1528)
  %onnx::Sqrt_1531 = Add(%onnx::Add_1529, %onnx::Add_324)
  %onnx::Div_1532 = Sqrt(%onnx::Sqrt_1531)
  %onnx::Mul_1533 = Div(%onnx::Pow_1526, %onnx::Div_1532)
  %onnx::Add_1534 = Mul(%onnx::Mul_1533, %layers.6.final_layer_norm.weight)
  %onnx::MatMul_1535 = Add(%onnx::Add_1534, %layers.6.final_layer_norm.bias)
  %onnx::Add_1537 = MatMul(%onnx::MatMul_1535, %onnx::MatMul_3300)
  %input.83 = Add(%layers.6.fc1.bias, %onnx::Add_1537)
  %hidden_states.79 = Relu(%input.83)
  %onnx::Add_1541 = MatMul(%hidden_states.79, %onnx::MatMul_3301)
  %hidden_states.83 = Add(%layers.6.fc2.bias, %onnx::Add_1541)
  %input.87 = Add(%input.79, %hidden_states.83)
  %onnx::Sub_1544 = ReduceMean[axes = [-1]](%input.87)
  %onnx::Pow_1545 = Sub(%input.87, %onnx::Sub_1544)
  %onnx::ReduceMean_1547 = Pow(%onnx::Pow_1545, %onnx::Pow_321)
  %onnx::Add_1548 = ReduceMean[axes = [-1]](%onnx::ReduceMean_1547)
  %onnx::Sqrt_1550 = Add(%onnx::Add_1548, %onnx::Add_324)
  %onnx::Div_1551 = Sqrt(%onnx::Sqrt_1550)
  %onnx::Mul_1552 = Div(%onnx::Pow_1545, %onnx::Div_1551)
  %onnx::Add_1553 = Mul(%onnx::Mul_1552, %layers.7.self_attn_layer_norm.weight)
  %onnx::Shape_1554 = Add(%onnx::Add_1553, %layers.7.self_attn_layer_norm.bias)
  %onnx::Gather_1555 = Shape(%onnx::Shape_1554)
  %onnx::Unsqueeze_1557 = Gather[axis = 0](%onnx::Gather_1555, %onnx::Range_3131)
  %onnx::Unsqueeze_1560 = Gather[axis = 0](%onnx::Gather_1555, %onnx::Range_3132)
  %onnx::Add_1562 = MatMul(%onnx::Shape_1554, %onnx::MatMul_3302)
  %onnx::Mul_1563 = Add(%layers.7.self_attn.q_proj.bias, %onnx::Add_1562)
  %query_states.27 = Mul(%onnx::Mul_1563, %onnx::Mul_339)
  %onnx::Add_1567 = MatMul(%onnx::Shape_1554, %onnx::MatMul_3303)
  %onnx::Reshape_1568 = Add(%layers.7.self_attn.k_proj.bias, %onnx::Add_1567)
  %onnx::Concat_1573 = Unsqueeze(%onnx::Unsqueeze_1557, %onnx::Unsqueeze_268)
  %onnx::Reshape_1580 = Concat[axis = 0](%onnx::Concat_1573, %onnx::Concat_3130, %onnx::Concat_3137, %onnx::Concat_3138)
  %onnx::Transpose_1581 = Reshape(%onnx::Reshape_1568, %onnx::Reshape_1580)
  %onnx::Reshape_1582 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_1581)
  %onnx::Add_1584 = MatMul(%onnx::Shape_1554, %onnx::MatMul_3307)
  %onnx::Reshape_1585 = Add(%layers.7.self_attn.v_proj.bias, %onnx::Add_1584)
  %onnx::Transpose_1598 = Reshape(%onnx::Reshape_1585, %onnx::Reshape_1580)
  %onnx::Reshape_1599 = Transpose[perm = [0, 2, 1, 3]](%onnx::Transpose_1598)
  %onnx::Unsqueeze_1601 = Mul(%onnx::Unsqueeze_1557, %onnx::Mul_375)
  %onnx::Concat_1607 = Unsqueeze(%onnx::Unsqueeze_1560, %onnx::Unsqueeze_268)
