graph torch_jit (
  %input_ids[INT32, batch_sizexsequence]
  %attention_mask[INT32, batch_sizexsequence]
) initializers (
  %embed_tokens.weight[FLOAT16, 96104x1024]
  %embed_positions.weight[FLOAT16, 1024x1024]
  %layers.0.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.0.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.0.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.0.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.0.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.0.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.0.fc1.bias[FLOAT, 4096]
  %layers.0.fc2.bias[FLOAT, 1024]
  %layers.0.final_layer_norm.weight[FLOAT, 1024]
  %layers.0.final_layer_norm.bias[FLOAT, 1024]
  %layers.1.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.1.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.1.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.1.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.1.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.1.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.1.fc1.bias[FLOAT, 4096]
  %layers.1.fc2.bias[FLOAT, 1024]
  %layers.1.final_layer_norm.weight[FLOAT, 1024]
  %layers.1.final_layer_norm.bias[FLOAT, 1024]
  %layers.2.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.2.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.2.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.2.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.2.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.2.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.2.fc1.bias[FLOAT, 4096]
  %layers.2.fc2.bias[FLOAT, 1024]
  %layers.2.final_layer_norm.weight[FLOAT, 1024]
  %layers.2.final_layer_norm.bias[FLOAT, 1024]
  %layers.3.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.3.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.3.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.3.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.3.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.3.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.3.fc1.bias[FLOAT, 4096]
  %layers.3.fc2.bias[FLOAT, 1024]
  %layers.3.final_layer_norm.weight[FLOAT, 1024]
  %layers.3.final_layer_norm.bias[FLOAT, 1024]
  %layers.4.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.4.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.4.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.4.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.4.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.4.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.4.fc1.bias[FLOAT, 4096]
  %layers.4.fc2.bias[FLOAT, 1024]
  %layers.4.final_layer_norm.weight[FLOAT, 1024]
  %layers.4.final_layer_norm.bias[FLOAT, 1024]
  %layers.5.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.5.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.5.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.5.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.5.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.5.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.5.fc1.bias[FLOAT, 4096]
  %layers.5.fc2.bias[FLOAT, 1024]
  %layers.5.final_layer_norm.weight[FLOAT, 1024]
  %layers.5.final_layer_norm.bias[FLOAT, 1024]
  %layers.6.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.6.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.6.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.6.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.6.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.6.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.6.fc1.bias[FLOAT, 4096]
  %layers.6.fc2.bias[FLOAT, 1024]
  %layers.6.final_layer_norm.weight[FLOAT, 1024]
  %layers.6.final_layer_norm.bias[FLOAT, 1024]
  %layers.7.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.7.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.7.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.7.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.7.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.7.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.7.fc1.bias[FLOAT, 4096]
  %layers.7.fc2.bias[FLOAT, 1024]
  %layers.7.final_layer_norm.weight[FLOAT, 1024]
  %layers.7.final_layer_norm.bias[FLOAT, 1024]
  %layers.8.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.8.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.8.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.8.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.8.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.8.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.8.fc1.bias[FLOAT, 4096]
  %layers.8.fc2.bias[FLOAT, 1024]
  %layers.8.final_layer_norm.weight[FLOAT, 1024]
  %layers.8.final_layer_norm.bias[FLOAT, 1024]
  %layers.9.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.9.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.9.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.9.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.9.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.9.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.9.fc1.bias[FLOAT, 4096]
  %layers.9.fc2.bias[FLOAT, 1024]
  %layers.9.final_layer_norm.weight[FLOAT, 1024]
  %layers.9.final_layer_norm.bias[FLOAT, 1024]
  %layers.10.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.10.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.10.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.10.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.10.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.10.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.10.fc1.bias[FLOAT, 4096]
  %layers.10.fc2.bias[FLOAT, 1024]
  %layers.10.final_layer_norm.weight[FLOAT, 1024]
  %layers.10.final_layer_norm.bias[FLOAT, 1024]
  %layers.11.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.11.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.11.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.11.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.11.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.11.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.11.fc1.bias[FLOAT, 4096]
  %layers.11.fc2.bias[FLOAT, 1024]
  %layers.11.final_layer_norm.weight[FLOAT, 1024]
  %layers.11.final_layer_norm.bias[FLOAT, 1024]
  %layers.12.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.12.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.12.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.12.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.12.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.12.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.12.fc1.bias[FLOAT, 4096]
  %layers.12.fc2.bias[FLOAT, 1024]
  %layers.12.final_layer_norm.weight[FLOAT, 1024]
  %layers.12.final_layer_norm.bias[FLOAT, 1024]
  %layers.13.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.13.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.13.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.13.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.13.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.13.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.13.fc1.bias[FLOAT, 4096]
  %layers.13.fc2.bias[FLOAT, 1024]
  %layers.13.final_layer_norm.weight[FLOAT, 1024]
  %layers.13.final_layer_norm.bias[FLOAT, 1024]
  %layers.14.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.14.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.14.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.14.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.14.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.14.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.14.fc1.bias[FLOAT, 4096]
  %layers.14.fc2.bias[FLOAT, 1024]
  %layers.14.final_layer_norm.weight[FLOAT, 1024]
  %layers.14.final_layer_norm.bias[FLOAT, 1024]
  %layers.15.self_attn.k_proj.bias[FLOAT, 1024]
  %layers.15.self_attn.v_proj.bias[FLOAT, 1024]
  %layers.15.self_attn.q_proj.bias[FLOAT, 1024]
  %layers.15.self_attn.out_proj.bias[FLOAT, 1024]
  %layers.15.self_attn_layer_norm.weight[FLOAT, 1024]
  %layers.15.self_attn_layer_norm.bias[FLOAT, 1024]
  %layers.15.fc1.bias[FLOAT, 4096]
  %layers.15.fc2.bias[FLOAT, 1024]
  %layers.15.final_layer_norm.weight[FLOAT, 1024]
  %layers.15.final_layer_norm.bias[FLOAT, 1024]
  %layer_norm.weight[FLOAT, 1024]
  %layer_norm.bias[FLOAT, 1024]
  %onnx::MatMul_2836[FLOAT, 1024x1024]
  %onnx::MatMul_2837[FLOAT, 1024x4096]
  %onnx::MatMul_2838[FLOAT, 4096x1024]
  %onnx::MatMul_2860[FLOAT, 1024x1024]
  %onnx::MatMul_2861[FLOAT, 1024x4096]
  %onnx::MatMul_2862[FLOAT, 4096x1024]
  %onnx::MatMul_2884[FLOAT, 1024x1024]
  %onnx::MatMul_2885[FLOAT, 1024x4096]
  %onnx::MatMul_2886[FLOAT, 4096x1024]
  %onnx::MatMul_2908[FLOAT, 1024x1024]
  %onnx::MatMul_2909[FLOAT, 1024x4096]
  %onnx::MatMul_2910[FLOAT, 4096x1024]
  %onnx::MatMul_2932[FLOAT, 1024x1024]
  %onnx::MatMul_2933[FLOAT, 1024x4096]
  %onnx::MatMul_2934[FLOAT, 4096x1024]
  %onnx::MatMul_2956[FLOAT, 1024x1024]
  %onnx::MatMul_2957[FLOAT, 1024x4096]
  %onnx::MatMul_2958[FLOAT, 4096x1024]
  %onnx::MatMul_2980[FLOAT, 1024x1024]
  %onnx::MatMul_2981[FLOAT, 1024x4096]
  %onnx::MatMul_2982[FLOAT, 4096x1024]
  %onnx::MatMul_3004[FLOAT, 1024x1024]
  %onnx::MatMul_3005[FLOAT, 1024x4096]
  %onnx::MatMul_3006[FLOAT, 4096x1024]
  %onnx::MatMul_3028[FLOAT, 1024x1024]
  %onnx::MatMul_3029[FLOAT, 1024x4096]
  %onnx::MatMul_3030[FLOAT, 4096x1024]
  %onnx::MatMul_3052[FLOAT, 1024x1024]
  %onnx::MatMul_3053[FLOAT, 1024x4096]
  %onnx::MatMul_3054[FLOAT, 4096x1024]
  %onnx::MatMul_3076[FLOAT, 1024x1024]
  %onnx::MatMul_3077[FLOAT, 1024x4096]
  %onnx::MatMul_3078[FLOAT, 4096x1024]
  %onnx::MatMul_3100[FLOAT, 1024x1024]
  %onnx::MatMul_3101[FLOAT, 1024x4096]
  %onnx::MatMul_3102[FLOAT, 4096x1024]
  %onnx::MatMul_3124[FLOAT, 1024x1024]
  %onnx::MatMul_3125[FLOAT, 1024x4096]
  %onnx::MatMul_3126[FLOAT, 4096x1024]
  %onnx::MatMul_3148[FLOAT, 1024x1024]
  %onnx::MatMul_3149[FLOAT, 1024x4096]
  %onnx::MatMul_3150[FLOAT, 4096x1024]
  %onnx::MatMul_3172[FLOAT, 1024x1024]
  %onnx::MatMul_3173[FLOAT, 1024x4096]
  %onnx::MatMul_3174[FLOAT, 4096x1024]
  %onnx::MatMul_3196[FLOAT, 1024x1024]
  %onnx::MatMul_3197[FLOAT, 1024x4096]
  %onnx::MatMul_3198[FLOAT, 4096x1024]
  %/Constant_output_0[INT64, scalar]
  %/Constant_1_output_0[INT64, 1]
  %onnx::Unsqueeze_269[INT64, 1]
  %/embed_positions/Constant_output_0[INT64, scalar]
  %/Constant_8_output_0[INT64, 1]
  %/layers.0/self_attn/Constant_4_output_0[INT64, 1]
  %/layers.0/self_attn/Constant_5_output_0[INT64, 1]
  %/layers.0/self_attn/Constant_9_output_0[INT64, scalar]
  %/layers.0/self_attn/Constant_22_output_0[INT64, 1]
  %/Mul_input_cast_1[FLOAT, scalar]
  %/Sub_input_cast_0[FLOAT, scalar]
  %/Where_1_input_cast_1[FLOAT, scalar]
  %/layers.0/self_attn_layer_norm/Pow_input_cast_1[FLOAT, scalar]
  %/layers.0/self_attn_layer_norm/Add_input_cast_1[FLOAT, scalar]
  %/layers.0/self_attn/Mul_input_cast_1[FLOAT, scalar]
  %4383[INT64, 3]
  %4490[INT64, 2]
  %/ConstantOfShape_output_0[INT64, 4]
  %/Mul_1_output_0[INT64, 4]
  %4378[FLOAT, 1024x3072]
  %4385[FLOAT, 1024x3072]
  %4392[FLOAT, 1024x3072]
  %4399[FLOAT, 1024x3072]
  %4406[FLOAT, 1024x3072]
  %4413[FLOAT, 1024x3072]
  %4420[FLOAT, 1024x3072]
  %4427[FLOAT, 1024x3072]
  %4434[FLOAT, 1024x3072]
  %4441[FLOAT, 1024x3072]
  %4448[FLOAT, 1024x3072]
  %4455[FLOAT, 1024x3072]
  %4462[FLOAT, 1024x3072]
  %4469[FLOAT, 1024x3072]
  %4476[FLOAT, 1024x3072]
  %4483[FLOAT, 1024x3072]
) {
  %/Shape_1_output_0 = Shape(%attention_mask)
  %/Shape_output_0 = Shape(%input_ids)
  %/Gather_1_output_0 = Gather[axis = 0](%/Shape_1_output_0, %/embed_positions/Constant_output_0)
  %/Gather_2_output_0 = Gather[axis = 0](%/Shape_1_output_0, %/Constant_output_0)
  %/Gather_output_0 = Gather[axis = 0](%/Shape_output_0, %/Constant_output_0)
  %/Unsqueeze_2_output_0 = Unsqueeze(%attention_mask, %4490)
  %/Unsqueeze_3_output_0 = Unsqueeze(%/Gather_1_output_0, %onnx::Unsqueeze_269)
  %/Unsqueeze_4_output_0 = Unsqueeze(%/Gather_2_output_0, %onnx::Unsqueeze_269)
  %/Unsqueeze_output_0 = Unsqueeze(%/Gather_output_0, %onnx::Unsqueeze_269)
  %/Concat_1_output_0 = Concat[axis = 0](%/Unsqueeze_3_output_0, %/Constant_8_output_0, %/Unsqueeze_4_output_0, %/Unsqueeze_4_output_0)
  %/Concat_output_0 = Concat[axis = 0](%/Constant_1_output_0, %/Unsqueeze_output_0)
  %/embed_positions/Range_output_0 = Range(%/embed_positions/Constant_output_0, %/Gather_output_0, %/Constant_output_0)
  %/Reshape_output_0 = Reshape(%input_ids, %/Concat_output_0)
  %/embed_positions/Gather_output_0 = Gather(%embed_positions.weight, %/embed_positions/Range_output_0)
  %/embed_tokens/Gather_output_0 = Gather(%embed_tokens.weight, %/Reshape_output_0)
  %/Add_input_cast_1 = Cast[to = 1](%/embed_positions/Gather_output_0)
  %/Mul_input_cast_0 = Cast[to = 1](%/embed_tokens/Gather_output_0)
  %/Mul_output_cast_0 = Mul(%/Mul_input_cast_0, %/Mul_input_cast_1)
  %/Equal_output_0 = Equal(%/Concat_1_output_0, %/Mul_1_output_0)
  %/Mul_output_0 = Cast[to = 10](%/Mul_output_cast_0)
  %/Where_output_0 = Where(%/Equal_output_0, %/ConstantOfShape_output_0, %/Concat_1_output_0)
  %/Add_input_cast_0 = Cast[to = 1](%/Mul_output_0)
  %/Expand_output_0 = Expand(%/Unsqueeze_2_output_0, %/Where_output_0)
  %/Add_output_cast_0 = Add(%/Add_input_cast_0, %/Add_input_cast_1)
  %/Cast_output_cast_0 = Cast[to = 1](%/Expand_output_0)
  %/Add_output_0 = Cast[to = 10](%/Add_output_cast_0)
  %/Cast_output_0 = Cast[to = 10](%/Cast_output_cast_0)
  %/layers.0/self_attn_layer_norm/ReduceMean_input_cast_0 = Cast[to = 1](%/Add_output_0)
  %/Sub_input_cast_1 = Cast[to = 1](%/Cast_output_0)
  %/layers.0/self_attn_layer_norm/ReduceMean_output_cast_0 = ReduceMean[axes = [-1]](%/layers.0/self_attn_layer_norm/ReduceMean_input_cast_0)
  %/Sub_output_cast_0 = Sub(%/Sub_input_cast_0, %/Sub_input_cast_1)
  %/layers.0/self_attn_layer_norm/ReduceMean_output_0 = Cast[to = 10](%/layers.0/self_attn_layer_norm/ReduceMean_output_cast_0)
  %/Sub_output_0 = Cast[to = 10](%/Sub_output_cast_0)
  %/layers.0/self_attn_layer_norm/Sub_input_cast_1 = Cast[to = 1](%/layers.0/self_attn_layer_norm/ReduceMean_output_0)
  %/Cast_1_input_cast_0 = Cast[to = 1](%/Sub_output_0)
  %/layers.0/self_attn_layer_norm/Sub_output_cast_0 = Sub(%/layers.0/self_attn_layer_norm/ReduceMean_input_cast_0, %/layers.0/self_attn_layer_norm/Sub_input_cast_1)
  %/Cast_1_output_0 = Cast[to = 9](%/Cast_1_input_cast_0)
  %/layers.0/self_attn_layer_norm/Sub_output_0 = Cast[to = 10](%/layers.0/self_attn_layer_norm/Sub_output_cast_0)
  %/layers.0/self_attn_layer_norm/Pow_input_cast_0 = Cast[to = 1](%/layers.0/self_attn_layer_norm/Sub_output_0)
  %/Where_1_output_cast_0 = Where(%/Cast_1_output_0, %/Where_1_input_cast_1, %/Cast_1_input_cast_0)
  %/layers.0/self_attn_layer_norm/Pow_output_cast_0 = Pow(%/layers.0/self_attn_layer_norm/Pow_input_cast_0, %/layers.0/self_attn_layer_norm/Pow_input_cast_1)
  %/Where_1_output_0 = Cast[to = 10](%/Where_1_output_cast_0)
  %/layers.0/self_attn_layer_norm/Pow_output_0 = Cast[to = 10](%/layers.0/self_attn_layer_norm/Pow_output_cast_0)
  %/layers.0/self_attn/Add_input_cast_1 = Cast[to = 1](%/Where_1_output_0)
  %/layers.0/self_attn_layer_norm/ReduceMean_1_input_cast_0 = Cast[to = 1](%/layers.0/self_attn_layer_norm/Pow_output_0)
  %/layers.0/self_attn_layer_norm/ReduceMean_1_output_cast_0 = ReduceMean[axes = [-1]](%/layers.0/self_attn_layer_norm/ReduceMean_1_input_cast_0)
  %/layers.0/self_attn_layer_norm/ReduceMean_1_output_0 = Cast[to = 10](%/layers.0/self_attn_layer_norm/ReduceMean_1_output_cast_0)
  %/layers.0/self_attn_layer_norm/Add_input_cast_0 = Cast[to = 1](%/layers.0/self_attn_layer_norm/ReduceMean_1_output_0)
  %/layers.0/self_attn_layer_norm/Add_output_cast_0 = Add(%/layers.0/self_attn_layer_norm/Add_input_cast_0, %/layers.0/self_attn_layer_norm/Add_input_cast_1)
  %/layers.0/self_attn_layer_norm/Add_output_0 = Cast[to = 10](%/layers.0/self_attn_layer_norm/Add_output_cast_0)
  %/layers.0/self_attn_layer_norm/Sqrt_input_cast_0 = Cast[to = 1](%/layers.0/self_attn_layer_norm/Add_output_0)
  %/layers.0/self_attn_layer_norm/Sqrt_output_cast_0 = Sqrt(%/layers.0/self_attn_layer_norm/Sqrt_input_cast_0)
  %/layers.0/self_attn_layer_norm/Sqrt_output_0 = Cast[to = 10](%/layers.0/self_attn_layer_norm/Sqrt_output_cast_0)
  %/layers.0/self_attn_layer_norm/Div_input_cast_1 = Cast[to = 1](%/layers.0/self_attn_layer_norm/Sqrt_output_0)
  %/layers.0/self_attn_layer_norm/Div_output_cast_0 = Div(%/layers.0/self_attn_layer_norm/Pow_input_cast_0, %/layers.0/self_attn_layer_norm/Div_input_cast_1)
  %/layers.0/self_attn_layer_norm/Div_output_0 = Cast[to = 10](%/layers.0/self_attn_layer_norm/Div_output_cast_0)
  %/layers.0/self_attn_layer_norm/Mul_input_cast_0 = Cast[to = 1](%/layers.0/self_attn_layer_norm/Div_output_0)
  %/layers.0/self_attn_layer_norm/Mul_output_cast_0 = Mul(%/layers.0/self_attn_layer_norm/Mul_input_cast_0, %layers.0.self_attn_layer_norm.weight)
  %/layers.0/self_attn_layer_norm/Mul_output_0 = Cast[to = 10](%/layers.0/self_attn_layer_norm/Mul_output_cast_0)
  %/layers.0/self_attn_layer_norm/Add_1_input_cast_0 = Cast[to = 1](%/layers.0/self_attn_layer_norm/Mul_output_0)
  %/layers.0/self_attn_layer_norm/Add_1_output_cast_0 = Add(%/layers.0/self_attn_layer_norm/Add_1_input_cast_0, %layers.0.self_attn_layer_norm.bias)
  %/layers.0/self_attn_layer_norm/Add_1_output_0 = Cast[to = 10](%/layers.0/self_attn_layer_norm/Add_1_output_cast_0)
  %/layers.0/self_attn/Shape_output_0 = Shape(%/layers.0/self_attn_layer_norm/Add_1_output_0)
  %/layers.0/self_attn/q_proj/MatMul_input_cast_0 = Cast[to = 1](%/layers.0/self_attn_layer_norm/Add_1_output_0)
  %4379 = MatMul(%/layers.0/self_attn/q_proj/MatMul_input_cast_0, %4378)
  %4380, %4381, %4382 = Split[axis = -1](%4379, %4383)
  %/layers.0/self_attn/Gather_output_0 = Gather[axis = 0](%/layers.0/self_attn/Shape_output_0, %/embed_positions/Constant_output_0)
  %/layers.0/self_attn/Gather_1_output_0 = Gather[axis = 0](%/layers.0/self_attn/Shape_output_0, %/Constant_output_0)
  %/layers.0/self_attn/Unsqueeze_output_0 = Unsqueeze(%/layers.0/self_attn/Gather_output_0, %onnx::Unsqueeze_269)
  %/layers.0/self_attn/Mul_1_output_0 = Mul(%/layers.0/self_attn/Gather_output_0, %/layers.0/self_attn/Constant_9_output_0)
  %/layers.0/self_attn/Unsqueeze_3_output_0 = Unsqueeze(%/layers.0/self_attn/Gather_1_output_0, %onnx::Unsqueeze_269)
  %/layers.0/self_attn/q_proj/MatMul_output_0 = Cast[to = 10](%4380)
  %/layers.0/self_attn/k_proj/MatMul_output_0 = Cast[to = 10](%4381)
  %/layers.0/self_attn/v_proj/MatMul_output_0 = Cast[to = 10](%4382)
  %/layers.0/self_attn/Concat_output_0 = Concat[axis = 0](%/layers.0/self_attn/Unsqueeze_output_0, %/Constant_1_output_0, %/layers.0/self_attn/Constant_4_output_0, %/layers.0/self_attn/Constant_5_output_0)
  %/layers.0/self_attn/Unsqueeze_4_output_0 = Unsqueeze(%/layers.0/self_attn/Mul_1_output_0, %onnx::Unsqueeze_269)
  %/layers.0/self_attn/Concat_2_output_0 = Concat[axis = 0](%/layers.0/self_attn/Unsqueeze_output_0, %/layers.0/self_attn/Unsqueeze_3_output_0, %/layers.0/self_attn/Constant_4_output_0, %/layers.0/self_attn/Constant_5_output_0)
  %/layers.0/self_attn/Concat_8_output_0 = Concat[axis = 0](%/layers.0/self_attn/Unsqueeze_output_0, %/layers.0/self_attn/Constant_4_output_0, %/layers.0/self_attn/Unsqueeze_3_output_0, %/layers.0/self_attn/Constant_5_output_0)
  %/layers.0/self_attn/Concat_9_output_0 = Concat[axis = 0](%/layers.0/self_attn/Unsqueeze_output_0, %/layers.0/self_attn/Unsqueeze_3_output_0, %/layers.0/self_attn/Constant_22_output_0)
  %/layers.0/self_attn/q_proj/Add_input_cast_1 = Cast[to = 1](%/layers.0/self_attn/q_proj/MatMul_output_0)
  %/layers.0/self_attn/k_proj/Add_input_cast_1 = Cast[to = 1](%/layers.0/self_attn/k_proj/MatMul_output_0)
  %/layers.0/self_attn/v_proj/Add_input_cast_1 = Cast[to = 1](%/layers.0/self_attn/v_proj/MatMul_output_0)
  %/layers.0/self_attn/Concat_3_output_0 = Concat[axis = 0](%/layers.0/self_attn/Unsqueeze_4_output_0, %/Constant_1_output_0, %/layers.0/self_attn/Constant_5_output_0)
  %/layers.0/self_attn/q_proj/Add_output_cast_0 = Add(%layers.0.self_attn.q_proj.bias, %/layers.0/self_attn/q_proj/Add_input_cast_1)
  %/layers.0/self_attn/k_proj/Add_output_cast_0 = Add(%layers.0.self_attn.k_proj.bias, %/layers.0/self_attn/k_proj/Add_input_cast_1)
  %/layers.0/self_attn/v_proj/Add_output_cast_0 = Add(%layers.0.self_attn.v_proj.bias, %/layers.0/self_attn/v_proj/Add_input_cast_1)
  %/layers.0/self_attn/q_proj/Add_output_0 = Cast[to = 10](%/layers.0/self_attn/q_proj/Add_output_cast_0)
  %/layers.0/self_attn/k_proj/Add_output_0 = Cast[to = 10](%/layers.0/self_attn/k_proj/Add_output_cast_0)
  %/layers.0/self_attn/v_proj/Add_output_0 = Cast[to = 10](%/layers.0/self_attn/v_proj/Add_output_cast_0)
  %/layers.0/self_attn/Mul_input_cast_0 = Cast[to = 1](%/layers.0/self_attn/q_proj/Add_output_0)
  %/layers.0/self_attn/Reshape_input_cast_0 = Cast[to = 1](%/layers.0/self_attn/k_proj/Add_output_0)
  %/layers.0/self_attn/Reshape_1_input_cast_0 = Cast[to = 1](%/layers.0/self_attn/v_proj/Add_output_0)
  %/layers.0/self_attn/Mul_output_cast_0 = Mul(%/layers.0/self_attn/Mul_input_cast_0, %/layers.0/self_attn/Mul_input_cast_1)
  %/layers.0/self_attn/Reshape_output_cast_0 = Reshape(%/layers.0/self_attn/Reshape_input_cast_0, %/layers.0/self_attn/Concat_output_0)
  %/layers.0/self_attn/Reshape_1_output_cast_0 = Reshape(%/layers.0/self_attn/Reshape_1_input_cast_0, %/layers.0/self_attn/Concat_output_0)
  %/layers.0/self_attn/Mul_output_0 = Cast[to = 10](%/layers.0/self_attn/Mul_output_cast_0)
  %/layers.0/self_attn/Reshape_output_0 = Cast[to = 10](%/layers.0/self_attn/Reshape_output_cast_0)
  %/layers.0/self_attn/Reshape_1_output_0 = Cast[to = 10](%/layers.0/self_attn/Reshape_1_output_cast_0)
  %/layers.0/self_attn/Reshape_2_input_cast_0 = Cast[to = 1](%/layers.0/self_attn/Mul_output_0)
  %/layers.0/self_attn/Transpose_input_cast_0 = Cast[to = 1](%/layers.0/self_attn/Reshape_output_0)
  %/layers.0/self_attn/Transpose_1_input_cast_0 = Cast[to = 1](%/layers.0/self_attn/Reshape_1_output_0)
  %/layers.0/self_attn/Reshape_2_output_cast_0 = Reshape(%/layers.0/self_attn/Reshape_2_input_cast_0, %/layers.0/self_attn/Concat_2_output_0)
  %/layers.0/self_attn/Transpose_output_cast_0 = Transpose[perm = [0, 2, 1, 3]](%/layers.0/self_attn/Transpose_input_cast_0)
  %/layers.0/self_attn/Transpose_1_output_cast_0 = Transpose[perm = [0, 2, 1, 3]](%/layers.0/self_attn/Transpose_1_input_cast_0)
  %/layers.0/self_attn/Reshape_2_output_0 = Cast[to = 10](%/layers.0/self_attn/Reshape_2_output_cast_0)
  %/layers.0/self_attn/Transpose_output_0 = Cast[to = 10](%/layers.0/self_attn/Transpose_output_cast_0)
  %/layers.0/self_attn/Transpose_1_output_0 = Cast[to = 10](%/layers.0/self_attn/Transpose_1_output_cast_0)
  %/layers.0/self_attn/Transpose_2_input_cast_0 = Cast[to = 1](%/layers.0/self_attn/Reshape_2_output_0)
  %/layers.0/self_attn/Reshape_4_input_cast_0 = Cast[to = 1](%/layers.0/self_attn/Transpose_output_0)
  %/layers.0/self_attn/Reshape_5_input_cast_0 = Cast[to = 1](%/layers.0/self_attn/Transpose_1_output_0)
  %/layers.0/self_attn/Transpose_2_output_cast_0 = Transpose[perm = [0, 2, 1, 3]](%/layers.0/self_attn/Transpose_2_input_cast_0)
  %/layers.0/self_attn/Reshape_4_output_cast_0 = Reshape(%/layers.0/self_attn/Reshape_4_input_cast_0, %/layers.0/self_attn/Concat_3_output_0)
  %/layers.0/self_attn/Reshape_5_output_cast_0 = Reshape(%/layers.0/self_attn/Reshape_5_input_cast_0, %/layers.0/self_attn/Concat_3_output_0)
  %/layers.0/self_attn/Transpose_2_output_0 = Cast[to = 10](%/layers.0/self_attn/Transpose_2_output_cast_0)
  %/layers.0/self_attn/Reshape_4_output_0 = Cast[to = 10](%/layers.0/self_attn/Reshape_4_output_cast_0)
  %/layers.0/self_attn/Reshape_5_output_0 = Cast[to = 10](%/layers.0/self_attn/Reshape_5_output_cast_0)
  %/layers.0/self_attn/Reshape_3_input_cast_0 = Cast[to = 1](%/layers.0/self_attn/Transpose_2_output_0)
  %/layers.0/self_attn/Shape_2_output_0 = Shape(%/layers.0/self_attn/Reshape_4_output_0)
  %/layers.0/self_attn/Transpose_3_input_cast_0 = Cast[to = 1](%/layers.0/self_attn/Reshape_4_output_0)
  %/layers.0/self_attn/MatMul_1_input_cast_1 = Cast[to = 1](%/layers.0/self_attn/Reshape_5_output_0)
  %/layers.0/self_attn/Reshape_3_output_cast_0 = Reshape(%/layers.0/self_attn/Reshape_3_input_cast_0, %/layers.0/self_attn/Concat_3_output_0)
  %/layers.0/self_attn/Gather_2_output_0 = Gather[axis = 0](%/layers.0/self_attn/Shape_2_output_0, %/Constant_output_0)
  %/layers.0/self_attn/Transpose_3_output_cast_0 = Transpose[perm = [0, 2, 1]](%/layers.0/self_attn/Transpose_3_input_cast_0)
  %/layers.0/self_attn/Reshape_3_output_0 = Cast[to = 10](%/layers.0/self_attn/Reshape_3_output_cast_0)
  %/layers.0/self_attn/Unsqueeze_9_output_0 = Unsqueeze(%/layers.0/self_attn/Gather_2_output_0, %onnx::Unsqueeze_269)
  %/layers.0/self_attn/Transpose_3_output_0 = Cast[to = 10](%/layers.0/self_attn/Transpose_3_output_cast_0)
  %/layers.0/self_attn/MatMul_input_cast_0 = Cast[to = 1](%/layers.0/self_attn/Reshape_3_output_0)
  %/layers.0/self_attn/Concat_6_output_0 = Concat[axis = 0](%/layers.0/self_attn/Unsqueeze_output_0, %/layers.0/self_attn/Constant_4_output_0, %/layers.0/self_attn/Unsqueeze_3_output_0, %/layers.0/self_attn/Unsqueeze_9_output_0)
  %/layers.0/self_attn/Concat_7_output_0 = Concat[axis = 0](%/layers.0/self_attn/Unsqueeze_4_output_0, %/layers.0/self_attn/Unsqueeze_3_output_0, %/layers.0/self_attn/Unsqueeze_9_output_0)
  %/layers.0/self_attn/MatMul_input_cast_1 = Cast[to = 1](%/layers.0/self_attn/Transpose_3_output_0)
  %/layers.0/self_attn/MatMul_output_cast_0 = MatMul(%/layers.0/self_attn/MatMul_input_cast_0, %/layers.0/self_attn/MatMul_input_cast_1)
  %/layers.0/self_attn/MatMul_output_0 = Cast[to = 10](%/layers.0/self_attn/MatMul_output_cast_0)
  %/layers.0/self_attn/Reshape_6_input_cast_0 = Cast[to = 1](%/layers.0/self_attn/MatMul_output_0)
  %/layers.0/self_attn/Reshape_6_output_cast_0 = Reshape(%/layers.0/self_attn/Reshape_6_input_cast_0, %/layers.0/self_attn/Concat_6_output_0)
  %/layers.0/self_attn/Reshape_6_output_0 = Cast[to = 10](%/layers.0/self_attn/Reshape_6_output_cast_0)
  %/layers.0/self_attn/Add_input_cast_0 = Cast[to = 1](%/layers.0/self_attn/Reshape_6_output_0)
  %/layers.0/self_attn/Add_output_cast_0 = Add(%/layers.0/self_attn/Add_input_cast_0, %/layers.0/self_attn/Add_input_cast_1)
  %/layers.0/self_attn/Add_output_0 = Cast[to = 10](%/layers.0/self_attn/Add_output_cast_0)
  %/layers.0/self_attn/Reshape_7_input_cast_0 = Cast[to = 1](%/layers.0/self_attn/Add_output_0)
  %/layers.0/self_attn/Reshape_7_output_cast_0 = Reshape(%/layers.0/self_attn/Reshape_7_input_cast_0, %/layers.0/self_attn/Concat_7_output_0)
  %/layers.0/self_attn/Reshape_7_output_0 = Cast[to = 10](%/layers.0/self_attn/Reshape_7_output_cast_0)
  %/layers.0/self_attn/Softmax_input_cast_0 = Cast[to = 1](%/layers.0/self_attn/Reshape_7_output_0)
  %/layers.0/self_attn/Softmax_output_cast_0 = Softmax[axis = -1](%/layers.0/self_attn/Softmax_input_cast_0)
  %/layers.0/self_attn/Softmax_output_0 = Cast[to = 10](%/layers.0/self_attn/Softmax_output_cast_0)
  %/layers.0/self_attn/MatMul_1_input_cast_0 = Cast[to = 1](%/layers.0/self_attn/Softmax_output_0)
  %/layers.0/self_attn/MatMul_1_output_cast_0 = MatMul(%/layers.0/self_attn/MatMul_1_input_cast_0, %/layers.0/self_attn/MatMul_1_input_cast_1)
  %/layers.0/self_attn/MatMul_1_output_0 = Cast[to = 10](%/layers.0/self_attn/MatMul_1_output_cast_0)
  %/layers.0/self_attn/Reshape_8_input_cast_0 = Cast[to = 1](%/layers.0/self_attn/MatMul_1_output_0)
  %/layers.0/self_attn/Reshape_8_output_cast_0 = Reshape(%/layers.0/self_attn/Reshape_8_input_cast_0, %/layers.0/self_attn/Concat_8_output_0)
  %/layers.0/self_attn/Reshape_8_output_0 = Cast[to = 10](%/layers.0/self_attn/Reshape_8_output_cast_0)
  %/layers.0/self_attn/Transpose_4_input_cast_0 = Cast[to = 1](%/layers.0/self_attn/Reshape_8_output_0)
  %/layers.0/self_attn/Transpose_4_output_cast_0 = Transpose[perm = [0, 2, 1, 3]](%/layers.0/self_attn/Transpose_4_input_cast_0)
  %/layers.0/self_attn/Transpose_4_output_0 = Cast[to = 10](%/layers.0/self_attn/Transpose_4_output_cast_0)
  %/layers.0/self_attn/Reshape_9_input_cast_0 = Cast[to = 1](%/layers.0/self_attn/Transpose_4_output_0)
  %/layers.0/self_attn/Reshape_9_output_cast_0 = Reshape(%/layers.0/self_attn/Reshape_9_input_cast_0, %/layers.0/self_attn/Concat_9_output_0)
  %/layers.0/self_attn/Reshape_9_output_0 = Cast[to = 10](%/layers.0/self_attn/Reshape_9_output_cast_0)
  %/layers.0/self_attn/out_proj/MatMul_input_cast_0 = Cast[to = 1](%/layers.0/self_attn/Reshape_9_output_0)
  %/layers.0/self_attn/out_proj/MatMul_output_cast_0 = MatMul(%/layers.0/self_attn/out_proj/MatMul_input_cast_0, %onnx::MatMul_2836)
  %/layers.0/self_attn/out_proj/MatMul_output_0 = Cast[to = 10](%/layers.0/self_attn/out_proj/MatMul_output_cast_0)
  %/layers.0/self_attn/out_proj/Add_input_cast_1 = Cast[to = 1](%/layers.0/self_attn/out_proj/MatMul_output_0)
  %/layers.0/self_attn/out_proj/Add_output_cast_0 = Add(%layers.0.self_attn.out_proj.bias, %/layers.0/self_attn/out_proj/Add_input_cast_1)
  %/layers.0/self_attn/out_proj/Add_output_0 = Cast[to = 10](%/layers.0/self_attn/out_proj/Add_output_cast_0)
  %/layers.0/Add_input_cast_1 = Cast[to = 1](%/layers.0/self_attn/out_proj/Add_output_0)
  %/layers.0/Add_output_cast_0 = Add(%/layers.0/self_attn_layer_norm/ReduceMean_input_cast_0, %/layers.0/Add_input_cast_1)
  %/layers.0/Add_output_0 = Cast[to = 10](%/layers.0/Add_output_cast_0)
  %/layers.0/final_layer_norm/ReduceMean_input_cast_0 = Cast[to = 1](%/layers.0/Add_output_0)
  %/layers.0/final_layer_norm/ReduceMean_output_cast_0 = ReduceMean[axes = [-1]](%/layers.0/final_layer_norm/ReduceMean_input_cast_0)
  %/layers.0/final_layer_norm/ReduceMean_output_0 = Cast[to = 10](%/layers.0/final_layer_norm/ReduceMean_output_cast_0)
  %/layers.0/final_layer_norm/Sub_input_cast_1 = Cast[to = 1](%/layers.0/final_layer_norm/ReduceMean_output_0)
  %/layers.0/final_layer_norm/Sub_output_cast_0 = Sub(%/layers.0/final_layer_norm/ReduceMean_input_cast_0, %/layers.0/final_layer_norm/Sub_input_cast_1)
  %/layers.0/final_layer_norm/Sub_output_0 = Cast[to = 10](%/layers.0/final_layer_norm/Sub_output_cast_0)
  %/layers.0/final_layer_norm/Pow_input_cast_0 = Cast[to = 1](%/layers.0/final_layer_norm/Sub_output_0)
  %/layers.0/final_layer_norm/Pow_output_cast_0 = Pow(%/layers.0/final_layer_norm/Pow_input_cast_0, %/layers.0/self_attn_layer_norm/Pow_input_cast_1)
  %/layers.0/final_layer_norm/Pow_output_0 = Cast[to = 10](%/layers.0/final_layer_norm/Pow_output_cast_0)
  %/layers.0/final_layer_norm/ReduceMean_1_input_cast_0 = Cast[to = 1](%/layers.0/final_layer_norm/Pow_output_0)
  %/layers.0/final_layer_norm/ReduceMean_1_output_cast_0 = ReduceMean[axes = [-1]](%/layers.0/final_layer_norm/ReduceMean_1_input_cast_0)
  %/layers.0/final_layer_norm/ReduceMean_1_output_0 = Cast[to = 10](%/layers.0/final_layer_norm/ReduceMean_1_output_cast_0)
  %/layers.0/final_layer_norm/Add_input_cast_0 = Cast[to = 1](%/layers.0/final_layer_norm/ReduceMean_1_output_0)
  %/layers.0/final_layer_norm/Add_output_cast_0 = Add(%/layers.0/final_layer_norm/Add_input_cast_0, %/layers.0/self_attn_layer_norm/Add_input_cast_1)
  %/layers.0/final_layer_norm/Add_output_0 = Cast[to = 10](%/layers.0/final_layer_norm/Add_output_cast_0)
  %/layers.0/final_layer_norm/Sqrt_input_cast_0 = Cast[to = 1](%/layers.0/final_layer_norm/Add_output_0)
  %/layers.0/final_layer_norm/Sqrt_output_cast_0 = Sqrt(%/layers.0/final_layer_norm/Sqrt_input_cast_0)
  %/layers.0/final_layer_norm/Sqrt_output_0 = Cast[to = 10](%/layers.0/final_layer_norm/Sqrt_output_cast_0)
  %/layers.0/final_layer_norm/Div_input_cast_1 = Cast[to = 1](%/layers.0/final_layer_norm/Sqrt_output_0)
  %/layers.0/final_layer_norm/Div_output_cast_0 = Div(%/layers.0/final_layer_norm/Pow_input_cast_0, %/layers.0/final_layer_norm/Div_input_cast_1)
  %/layers.0/final_layer_norm/Div_output_0 = Cast[to = 10](%/layers.0/final_layer_norm/Div_output_cast_0)
  %/layers.0/final_layer_norm/Mul_input_cast_0 = Cast[to = 1](%/layers.0/final_layer_norm/Div_output_0)
  %/layers.0/final_layer_norm/Mul_output_cast_0 = Mul(%/layers.0/final_layer_norm/Mul_input_cast_0, %layers.0.final_layer_norm.weight)
  %/layers.0/final_layer_norm/Mul_output_0 = Cast[to = 10](%/layers.0/final_layer_norm/Mul_output_cast_0)
  %/layers.0/final_layer_norm/Add_1_input_cast_0 = Cast[to = 1](%/layers.0/final_layer_norm/Mul_output_0)
  %/layers.0/final_layer_norm/Add_1_output_cast_0 = Add(%/layers.0/final_layer_norm/Add_1_input_cast_0, %layers.0.final_layer_norm.bias)
  %/layers.0/final_layer_norm/Add_1_output_0 = Cast[to = 10](%/layers.0/final_layer_norm/Add_1_output_cast_0)
  %/layers.0/fc1/MatMul_input_cast_0 = Cast[to = 1](%/layers.0/final_layer_norm/Add_1_output_0)
  %/layers.0/fc1/MatMul_output_cast_0 = MatMul(%/layers.0/fc1/MatMul_input_cast_0, %onnx::MatMul_2837)
  %/layers.0/fc1/MatMul_output_0 = Cast[to = 10](%/layers.0/fc1/MatMul_output_cast_0)
  %/layers.0/fc1/Add_input_cast_1 = Cast[to = 1](%/layers.0/fc1/MatMul_output_0)
  %/layers.0/fc1/Add_output_cast_0 = Add(%layers.0.fc1.bias, %/layers.0/fc1/Add_input_cast_1)
  %/layers.0/fc1/Add_output_0 = Cast[to = 10](%/layers.0/fc1/Add_output_cast_0)
  %/layers.0/activation_fn/Relu_input_cast_0 = Cast[to = 1](%/layers.0/fc1/Add_output_0)
  %/layers.0/activation_fn/Relu_output_cast_0 = Relu(%/layers.0/activation_fn/Relu_input_cast_0)
  %/layers.0/activation_fn/Relu_output_0 = Cast[to = 10](%/layers.0/activation_fn/Relu_output_cast_0)
  %/layers.0/fc2/MatMul_input_cast_0 = Cast[to = 1](%/layers.0/activation_fn/Relu_output_0)
  %/layers.0/fc2/MatMul_output_cast_0 = MatMul(%/layers.0/fc2/MatMul_input_cast_0, %onnx::MatMul_2838)
  %/layers.0/fc2/MatMul_output_0 = Cast[to = 10](%/layers.0/fc2/MatMul_output_cast_0)
  %/layers.0/fc2/Add_input_cast_1 = Cast[to = 1](%/layers.0/fc2/MatMul_output_0)
  %/layers.0/fc2/Add_output_cast_0 = Add(%layers.0.fc2.bias, %/layers.0/fc2/Add_input_cast_1)
  %/layers.0/fc2/Add_output_0 = Cast[to = 10](%/layers.0/fc2/Add_output_cast_0)
  %/layers.0/Add_1_input_cast_1 = Cast[to = 1](%/layers.0/fc2/Add_output_0)
  %/layers.0/Add_1_output_cast_0 = Add(%/layers.0/final_layer_norm/ReduceMean_input_cast_0, %/layers.0/Add_1_input_cast_1)
  %/layers.0/Add_1_output_0 = Cast[to = 10](%/layers.0/Add_1_output_cast_0)
  %/layers.1/self_attn_layer_norm/ReduceMean_input_cast_0 = Cast[to = 1](%/layers.0/Add_1_output_0)
  %/layers.1/self_attn_layer_norm/ReduceMean_output_cast_0 = ReduceMean[axes = [-1]](%/layers.1/self_attn_layer_norm/ReduceMean_input_cast_0)
  %/layers.1/self_attn_layer_norm/ReduceMean_output_0 = Cast[to = 10](%/layers.1/self_attn_layer_norm/ReduceMean_output_cast_0)
  %/layers.1/self_attn_layer_norm/Sub_input_cast_1 = Cast[to = 1](%/layers.1/self_attn_layer_norm/ReduceMean_output_0)
  %/layers.1/self_attn_layer_norm/Sub_output_cast_0 = Sub(%/layers.1/self_attn_layer_norm/ReduceMean_input_cast_0, %/layers.1/self_attn_layer_norm/Sub_input_cast_1)
  %/layers.1/self_attn_layer_norm/Sub_output_0 = Cast[to = 10](%/layers.1/self_attn_layer_norm/Sub_output_cast_0)
  %/layers.1/self_attn_layer_norm/Pow_input_cast_0 = Cast[to = 1](%/layers.1/self_attn_layer_norm/Sub_output_0)
  %/layers.1/self_attn_layer_norm/Pow_output_cast_0 = Pow(%/layers.1/self_attn_layer_norm/Pow_input_cast_0, %/layers.0/self_attn_layer_norm/Pow_input_cast_1)
  %/layers.1/self_attn_layer_norm/Pow_output_0 = Cast[to = 10](%/layers.1/self_attn_layer_norm/Pow_output_cast_0)
  %/layers.1/self_attn_layer_norm/ReduceMean_1_input_cast_0 = Cast[to = 1](%/layers.1/self_attn_layer_norm/Pow_output_0)
  %/layers.1/self_attn_layer_norm/ReduceMean_1_output_cast_0 = ReduceMean[axes = [-1]](%/layers.1/self_attn_layer_norm/ReduceMean_1_input_cast_0)
  %/layers.1/self_attn_layer_norm/ReduceMean_1_output_0 = Cast[to = 10](%/layers.1/self_attn_layer_norm/ReduceMean_1_output_cast_0)
  %/layers.1/self_attn_layer_norm/Add_input_cast_0 = Cast[to = 1](%/layers.1/self_attn_layer_norm/ReduceMean_1_output_0)
  %/layers.1/self_attn_layer_norm/Add_output_cast_0 = Add(%/layers.1/self_attn_layer_norm/Add_input_cast_0, %/layers.0/self_attn_layer_norm/Add_input_cast_1)
  %/layers.1/self_attn_layer_norm/Add_output_0 = Cast[to = 10](%/layers.1/self_attn_layer_norm/Add_output_cast_0)
  %/layers.1/self_attn_layer_norm/Sqrt_input_cast_0 = Cast[to = 1](%/layers.1/self_attn_layer_norm/Add_output_0)
  %/layers.1/self_attn_layer_norm/Sqrt_output_cast_0 = Sqrt(%/layers.1/self_attn_layer_norm/Sqrt_input_cast_0)
  %/layers.1/self_attn_layer_norm/Sqrt_output_0 = Cast[to = 10](%/layers.1/self_attn_layer_norm/Sqrt_output_cast_0)
  %/layers.1/self_attn_layer_norm/Div_input_cast_1 = Cast[to = 1](%/layers.1/self_attn_layer_norm/Sqrt_output_0)
  %/layers.1/self_attn_layer_norm/Div_output_cast_0 = Div(%/layers.1/self_attn_layer_norm/Pow_input_cast_0, %/layers.1/self_attn_layer_norm/Div_input_cast_1)
  %/layers.1/self_attn_layer_norm/Div_output_0 = Cast[to = 10](%/layers.1/self_attn_layer_norm/Div_output_cast_0)
  %/layers.1/self_attn_layer_norm/Mul_input_cast_0 = Cast[to = 1](%/layers.1/self_attn_layer_norm/Div_output_0)
  %/layers.1/self_attn_layer_norm/Mul_output_cast_0 = Mul(%/layers.1/self_attn_layer_norm/Mul_input_cast_0, %layers.1.self_attn_layer_norm.weight)
  %/layers.1/self_attn_layer_norm/Mul_output_0 = Cast[to = 10](%/layers.1/self_attn_layer_norm/Mul_output_cast_0)
  %/layers.1/self_attn_layer_norm/Add_1_input_cast_0 = Cast[to = 1](%/layers.1/self_attn_layer_norm/Mul_output_0)
  %/layers.1/self_attn_layer_norm/Add_1_output_cast_0 = Add(%/layers.1/self_attn_layer_norm/Add_1_input_cast_0, %layers.1.self_attn_layer_norm.bias)
  %/layers.1/self_attn_layer_norm/Add_1_output_0 = Cast[to = 10](%/layers.1/self_attn_layer_norm/Add_1_output_cast_0)
  %/layers.1/self_attn/Shape_output_0 = Shape(%/layers.1/self_attn_layer_norm/Add_1_output_0)
  %/layers.1/self_attn/q_proj/MatMul_input_cast_0 = Cast[to = 1](%/layers.1/self_attn_layer_norm/Add_1_output_0)
  %4386 = MatMul(%/layers.1/self_attn/q_proj/MatMul_input_cast_0, %4385)
  %4387, %4388, %4389 = Split[axis = -1](%4386, %4383)
  %/layers.1/self_attn/Gather_output_0 = Gather[axis = 0](%/layers.1/self_attn/Shape_output_0, %/embed_positions/Constant_output_0)
  %/layers.1/self_attn/Gather_1_output_0 = Gather[axis = 0](%/layers.1/self_attn/Shape_output_0, %/Constant_output_0)
  %/layers.1/self_attn/Unsqueeze_output_0 = Unsqueeze(%/layers.1/self_attn/Gather_output_0, %onnx::Unsqueeze_269)
  %/layers.1/self_attn/Mul_1_output_0 = Mul(%/layers.1/self_attn/Gather_output_0, %/layers.0/self_attn/Constant_9_output_0)
  %/layers.1/self_attn/Unsqueeze_3_output_0 = Unsqueeze(%/layers.1/self_attn/Gather_1_output_0, %onnx::Unsqueeze_269)
  %/layers.1/self_attn/q_proj/MatMul_output_0 = Cast[to = 10](%4387)
  %/layers.1/self_attn/k_proj/MatMul_output_0 = Cast[to = 10](%4388)
  %/layers.1/self_attn/v_proj/MatMul_output_0 = Cast[to = 10](%4389)
  %/layers.1/self_attn/Concat_output_0 = Concat[axis = 0](%/layers.1/self_attn/Unsqueeze_output_0, %/Constant_1_output_0, %/layers.0/self_attn/Constant_4_output_0, %/layers.0/self_attn/Constant_5_output_0)
  %/layers.1/self_attn/Unsqueeze_4_output_0 = Unsqueeze(%/layers.1/self_attn/Mul_1_output_0, %onnx::Unsqueeze_269)
  %/layers.1/self_attn/Concat_2_output_0 = Concat[axis = 0](%/layers.1/self_attn/Unsqueeze_output_0, %/layers.1/self_attn/Unsqueeze_3_output_0, %/layers.0/self_attn/Constant_4_output_0, %/layers.0/self_attn/Constant_5_output_0)
  %/layers.1/self_attn/Concat_8_output_0 = Concat[axis = 0](%/layers.1/self_attn/Unsqueeze_output_0, %/layers.0/self_attn/Constant_4_output_0, %/layers.1/self_attn/Unsqueeze_3_output_0, %/layers.0/self_attn/Constant_5_output_0)
  %/layers.1/self_attn/Concat_9_output_0 = Concat[axis = 0](%/layers.1/self_attn/Unsqueeze_output_0, %/layers.1/self_attn/Unsqueeze_3_output_0, %/layers.0/self_attn/Constant_22_output_0)
  %/layers.1/self_attn/q_proj/Add_input_cast_1 = Cast[to = 1](%/layers.1/self_attn/q_proj/MatMul_output_0)
  %/layers.1/self_attn/k_proj/Add_input_cast_1 = Cast[to = 1](%/layers.1/self_attn/k_proj/MatMul_output_0)
  %/layers.1/self_attn/v_proj/Add_input_cast_1 = Cast[to = 1](%/layers.1/self_attn/v_proj/MatMul_output_0)
  %/layers.1/self_attn/Concat_3_output_0 = Concat[axis = 0](%/layers.1/self_attn/Unsqueeze_4_output_0, %/Constant_1_output_0, %/layers.0/self_attn/Constant_5_output_0)
  %/layers.1/self_attn/q_proj/Add_output_cast_0 = Add(%layers.1.self_attn.q_proj.bias, %/layers.1/self_attn/q_proj/Add_input_cast_1)
  %/layers.1/self_attn/k_proj/Add_output_cast_0 = Add(%layers.1.self_attn.k_proj.bias, %/layers.1/self_attn/k_proj/Add_input_cast_1)
  %/layers.1/self_attn/v_proj/Add_output_cast_0 = Add(%layers.1.self_attn.v_proj.bias, %/layers.1/self_attn/v_proj/Add_input_cast_1)
  %/layers.1/self_attn/q_proj/Add_output_0 = Cast[to = 10](%/layers.1/self_attn/q_proj/Add_output_cast_0)
  %/layers.1/self_attn/k_proj/Add_output_0 = Cast[to = 10](%/layers.1/self_attn/k_proj/Add_output_cast_0)
  %/layers.1/self_attn/v_proj/Add_output_0 = Cast[to = 10](%/layers.1/self_attn/v_proj/Add_output_cast_0)
  %/layers.1/self_attn/Mul_input_cast_0 = Cast[to = 1](%/layers.1/self_attn/q_proj/Add_output_0)
  %/layers.1/self_attn/Reshape_input_cast_0 = Cast[to = 1](%/layers.1/self_attn/k_proj/Add_output_0)
  %/layers.1/self_attn/Reshape_1_input_cast_0 = Cast[to = 1](%/layers.1/self_attn/v_proj/Add_output_0)
  %/layers.1/self_attn/Mul_output_cast_0 = Mul(%/layers.1/self_attn/Mul_input_cast_0, %/layers.0/self_attn/Mul_input_cast_1)
  %/layers.1/self_attn/Reshape_output_cast_0 = Reshape(%/layers.1/self_attn/Reshape_input_cast_0, %/layers.1/self_attn/Concat_output_0)
  %/layers.1/self_attn/Reshape_1_output_cast_0 = Reshape(%/layers.1/self_attn/Reshape_1_input_cast_0, %/layers.1/self_attn/Concat_output_0)
  %/layers.1/self_attn/Mul_output_0 = Cast[to = 10](%/layers.1/self_attn/Mul_output_cast_0)
  %/layers.1/self_attn/Reshape_output_0 = Cast[to = 10](%/layers.1/self_attn/Reshape_output_cast_0)
  %/layers.1/self_attn/Reshape_1_output_0 = Cast[to = 10](%/layers.1/self_attn/Reshape_1_output_cast_0)
  %/layers.1/self_attn/Reshape_2_input_cast_0 = Cast[to = 1](%/layers.1/self_attn/Mul_output_0)
  %/layers.1/self_attn/Transpose_input_cast_0 = Cast[to = 1](%/layers.1/self_attn/Reshape_output_0)
  %/layers.1/self_attn/Transpose_1_input_cast_0 = Cast[to = 1](%/layers.1/self_attn/Reshape_1_output_0)
  %/layers.1/self_attn/Reshape_2_output_cast_0 = Reshape(%/layers.1/self_attn/Reshape_2_input_cast_0, %/layers.1/self_attn/Concat_2_output_0)
  %/layers.1/self_attn/Transpose_output_cast_0 = Transpose[perm = [0, 2, 1, 3]](%/layers.1/self_attn/Transpose_input_cast_0)
  %/layers.1/self_attn/Transpose_1_output_cast_0 = Transpose[perm = [0, 2, 1, 3]](%/layers.1/self_attn/Transpose_1_input_cast_0)
  %/layers.1/self_attn/Reshape_2_output_0 = Cast[to = 10](%/layers.1/self_attn/Reshape_2_output_cast_0)
  %/layers.1/self_attn/Transpose_output_0 = Cast[to = 10](%/layers.1/self_attn/Transpose_output_cast_0)
  %/layers.1/self_attn/Transpose_1_output_0 = Cast[to = 10](%/layers.1/self_attn/Transpose_1_output_cast_0)
  %/layers.1/self_attn/Transpose_2_input_cast_0 = Cast[to = 1](%/layers.1/self_attn/Reshape_2_output_0)
  %/layers.1/self_attn/Reshape_4_input_cast_0 = Cast[to = 1](%/layers.1/self_attn/Transpose_output_0)
  %/layers.1/self_attn/Reshape_5_input_cast_0 = Cast[to = 1](%/layers.1/self_attn/Transpose_1_output_0)
  %/layers.1/self_attn/Transpose_2_output_cast_0 = Transpose[perm = [0, 2, 1, 3]](%/layers.1/self_attn/Transpose_2_input_cast_0)
  %/layers.1/self_attn/Reshape_4_output_cast_0 = Reshape(%/layers.1/self_attn/Reshape_4_input_cast_0, %/layers.1/self_attn/Concat_3_output_0)
  %/layers.1/self_attn/Reshape_5_output_cast_0 = Reshape(%/layers.1/self_attn/Reshape_5_input_cast_0, %/layers.1/self_attn/Concat_3_output_0)
  %/layers.1/self_attn/Transpose_2_output_0 = Cast[to = 10](%/layers.1/self_attn/Transpose_2_output_cast_0)
  %/layers.1/self_attn/Reshape_4_output_0 = Cast[to = 10](%/layers.1/self_attn/Reshape_4_output_cast_0)
  %/layers.1/self_attn/Reshape_5_output_0 = Cast[to = 10](%/layers.1/self_attn/Reshape_5_output_cast_0)
  %/layers.1/self_attn/Reshape_3_input_cast_0 = Cast[to = 1](%/layers.1/self_attn/Transpose_2_output_0)
  %/layers.1/self_attn/Shape_2_output_0 = Shape(%/layers.1/self_attn/Reshape_4_output_0)
  %/layers.1/self_attn/Transpose_3_input_cast_0 = Cast[to = 1](%/layers.1/self_attn/Reshape_4_output_0)
  %/layers.1/self_attn/MatMul_1_input_cast_1 = Cast[to = 1](%/layers.1/self_attn/Reshape_5_output_0)
  %/layers.1/self_attn/Reshape_3_output_cast_0 = Reshape(%/layers.1/self_attn/Reshape_3_input_cast_0, %/layers.1/self_attn/Concat_3_output_0)
  %/layers.1/self_attn/Gather_2_output_0 = Gather[axis = 0](%/layers.1/self_attn/Shape_2_output_0, %/Constant_output_0)
  %/layers.1/self_attn/Transpose_3_output_cast_0 = Transpose[perm = [0, 2, 1]](%/layers.1/self_attn/Transpose_3_input_cast_0)
  %/layers.1/self_attn/Reshape_3_output_0 = Cast[to = 10](%/layers.1/self_attn/Reshape_3_output_cast_0)
  %/layers.1/self_attn/Unsqueeze_9_output_0 = Unsqueeze(%/layers.1/self_attn/Gather_2_output_0, %onnx::Unsqueeze_269)
  %/layers.1/self_attn/Transpose_3_output_0 = Cast[to = 10](%/layers.1/self_attn/Transpose_3_output_cast_0)
  %/layers.1/self_attn/MatMul_input_cast_0 = Cast[to = 1](%/layers.1/self_attn/Reshape_3_output_0)
  %/layers.1/self_attn/Concat_6_output_0 = Concat[axis = 0](%/layers.1/self_attn/Unsqueeze_output_0, %/layers.0/self_attn/Constant_4_output_0, %/layers.1/self_attn/Unsqueeze_3_output_0, %/layers.1/self_attn/Unsqueeze_9_output_0)
  %/layers.1/self_attn/Concat_7_output_0 = Concat[axis = 0](%/layers.1/self_attn/Unsqueeze_4_output_0, %/layers.1/self_attn/Unsqueeze_3_output_0, %/layers.1/self_attn/Unsqueeze_9_output_0)
  %/layers.1/self_attn/MatMul_input_cast_1 = Cast[to = 1](%/layers.1/self_attn/Transpose_3_output_0)
  %/layers.1/self_attn/MatMul_output_cast_0 = MatMul(%/layers.1/self_attn/MatMul_input_cast_0, %/layers.1/self_attn/MatMul_input_cast_1)
  %/layers.1/self_attn/MatMul_output_0 = Cast[to = 10](%/layers.1/self_attn/MatMul_output_cast_0)
  %/layers.1/self_attn/Reshape_6_input_cast_0 = Cast[to = 1](%/layers.1/self_attn/MatMul_output_0)
  %/layers.1/self_attn/Reshape_6_output_cast_0 = Reshape(%/layers.1/self_attn/Reshape_6_input_cast_0, %/layers.1/self_attn/Concat_6_output_0)
  %/layers.1/self_attn/Reshape_6_output_0 = Cast[to = 10](%/layers.1/self_attn/Reshape_6_output_cast_0)
  %/layers.1/self_attn/Add_input_cast_0 = Cast[to = 1](%/layers.1/self_attn/Reshape_6_output_0)
  %/layers.1/self_attn/Add_output_cast_0 = Add(%/layers.1/self_attn/Add_input_cast_0, %/layers.0/self_attn/Add_input_cast_1)
  %/layers.1/self_attn/Add_output_0 = Cast[to = 10](%/layers.1/self_attn/Add_output_cast_0)
  %/layers.1/self_attn/Reshape_7_input_cast_0 = Cast[to = 1](%/layers.1/self_attn/Add_output_0)
  %/layers.1/self_attn/Reshape_7_output_cast_0 = Reshape(%/layers.1/self_attn/Reshape_7_input_cast_0, %/layers.1/self_attn/Concat_7_output_0)
  %/layers.1/self_attn/Reshape_7_output_0 = Cast[to = 10](%/layers.1/self_attn/Reshape_7_output_cast_0)
  %/layers.1/self_attn/Softmax_input_cast_0 = Cast[to = 1](%/layers.1/self_attn/Reshape_7_output_0)
  %/layers.1/self_attn/Softmax_output_cast_0 = Softmax[axis = -1](%/layers.1/self_attn/Softmax_input_cast_0)
  %/layers.1/self_attn/Softmax_output_0 = Cast[to = 10](%/layers.1/self_attn/Softmax_output_cast_0)
  %/layers.1/self_attn/MatMul_1_input_cast_0 = Cast[to = 1](%/layers.1/self_attn/Softmax_output_0)
  %/layers.1/self_attn/MatMul_1_output_cast_0 = MatMul(%/layers.1/self_attn/MatMul_1_input_cast_0, %/layers.1/self_attn/MatMul_1_input_cast_1)
  %/layers.1/self_attn/MatMul_1_output_0 = Cast[to = 10](%/layers.1/self_attn/MatMul_1_output_cast_0)
  %/layers.1/self_attn/Reshape_8_input_cast_0 = Cast[to = 1](%/layers.1/self_attn/MatMul_1_output_0)
  %/layers.1/self_attn/Reshape_8_output_cast_0 = Reshape(%/layers.1/self_attn/Reshape_8_input_cast_0, %/layers.1/self_attn/Concat_8_output_0)
  %/layers.1/self_attn/Reshape_8_output_0 = Cast[to = 10](%/layers.1/self_attn/Reshape_8_output_cast_0)
  %/layers.1/self_attn/Transpose_4_input_cast_0 = Cast[to = 1](%/layers.1/self_attn/Reshape_8_output_0)
  %/layers.1/self_attn/Transpose_4_output_cast_0 = Transpose[perm = [0, 2, 1, 3]](%/layers.1/self_attn/Transpose_4_input_cast_0)
  %/layers.1/self_attn/Transpose_4_output_0 = Cast[to = 10](%/layers.1/self_attn/Transpose_4_output_cast_0)
  %/layers.1/self_attn/Reshape_9_input_cast_0 = Cast[to = 1](%/layers.1/self_attn/Transpose_4_output_0)
  %/layers.1/self_attn/Reshape_9_output_cast_0 = Reshape(%/layers.1/self_attn/Reshape_9_input_cast_0, %/layers.1/self_attn/Concat_9_output_0)
  %/layers.1/self_attn/Reshape_9_output_0 = Cast[to = 10](%/layers.1/self_attn/Reshape_9_output_cast_0)
  %/layers.1/self_attn/out_proj/MatMul_input_cast_0 = Cast[to = 1](%/layers.1/self_attn/Reshape_9_output_0)
  %/layers.1/self_attn/out_proj/MatMul_output_cast_0 = MatMul(%/layers.1/self_attn/out_proj/MatMul_input_cast_0, %onnx::MatMul_2860)
  %/layers.1/self_attn/out_proj/MatMul_output_0 = Cast[to = 10](%/layers.1/self_attn/out_proj/MatMul_output_cast_0)
  %/layers.1/self_attn/out_proj/Add_input_cast_1 = Cast[to = 1](%/layers.1/self_attn/out_proj/MatMul_output_0)
  %/layers.1/self_attn/out_proj/Add_output_cast_0 = Add(%layers.1.self_attn.out_proj.bias, %/layers.1/self_attn/out_proj/Add_input_cast_1)
  %/layers.1/self_attn/out_proj/Add_output_0 = Cast[to = 10](%/layers.1/self_attn/out_proj/Add_output_cast_0)
  %/layers.1/Add_input_cast_1 = Cast[to = 1](%/layers.1/self_attn/out_proj/Add_output_0)
  %/layers.1/Add_output_cast_0 = Add(%/layers.1/self_attn_layer_norm/ReduceMean_input_cast_0, %/layers.1/Add_input_cast_1)
  %/layers.1/Add_output_0 = Cast[to = 10](%/layers.1/Add_output_cast_0)
  %/layers.1/final_layer_norm/ReduceMean_input_cast_0 = Cast[to = 1](%/layers.1/Add_output_0)
  %/layers.1/final_layer_norm/ReduceMean_output_cast_0 = ReduceMean[axes = [-1]](%/layers.1/final_layer_norm/ReduceMean_input_cast_0)
  %/layers.1/final_layer_norm/ReduceMean_output_0 = Cast[to = 10](%/layers.1/final_layer_norm/ReduceMean_output_cast_0)
  %/layers.1/final_layer_norm/Sub_input_cast_1 = Cast[to = 1](%/layers.1/final_layer_norm/ReduceMean_output_0)
  %/layers.1/final_layer_norm/Sub_output_cast_0 = Sub(%/layers.1/final_layer_norm/ReduceMean_input_cast_0, %/layers.1/final_layer_norm/Sub_input_cast_1)
  %/layers.1/final_layer_norm/Sub_output_0 = Cast[to = 10](%/layers.1/final_layer_norm/Sub_output_cast_0)
  %/layers.1/final_layer_norm/Pow_input_cast_0 = Cast[to = 1](%/layers.1/final_layer_norm/Sub_output_0)
  %/layers.1/final_layer_norm/Pow_output_cast_0 = Pow(%/layers.1/final_layer_norm/Pow_input_cast_0, %/layers.0/self_attn_layer_norm/Pow_input_cast_1)
